Daniel9719/Emotion_Detector_UNAM/CCS/Sensor_Testing_Files/tms320f28379d.h
//*****************************************************************************
//
// tms320f28379d.h - TMS320F28379D Register Definitions
//
//*****************************************************************************
#ifndef TMS320F28379D_H_
#define TMS320F28379D_H_

#include<stdint.h>

//*****************************************************************************
//
// Timer registers (TIMER0)
//
//*****************************************************************************
#define TIMER0_TIM_R                (*((volatile uint32_t *)0x00000C00))
#define TIMER0_PRD_R                (*((volatile uint32_t *)0x00000C02))
#define TIMER0_TCR_R                (*((volatile uint32_t *)0x00000C04))
#define TIMER0_TPR_R                (*((volatile uint32_t *)0x00000C06))
#define TIMER0_TPRH_R               (*((volatile uint32_t *)0x00000C07))

//*****************************************************************************
//
// Timer registers (TIMER1)
//
//*****************************************************************************
#define TIMER1_TIM_R                (*((volatile uint32_t *)0x00000C08))
#define TIMER1_PRD_R                (*((volatile uint32_t *)0x00000C0A))
#define TIMER1_TCR_R                (*((volatile uint32_t *)0x00000C0C))
#define TIMER1_TPR_R                (*((volatile uint32_t *)0x00000C0E))
#define TIMER1_TPRH_R               (*((volatile uint32_t *)0x00000C0F))

//*****************************************************************************
//
// Timer registers (TIMER2)
//
//*****************************************************************************
#define TIMER2_TIM_R                (*((volatile uint32_t *)0x00000C10))
#define TIMER2_PRD_R                (*((volatile uint32_t *)0x00000C12))
#define TIMER2_TCR_R                (*((volatile uint32_t *)0x00000C14))
#define TIMER2_TPR_R                (*((volatile uint32_t *)0x00000C16))
#define TIMER2_TPRH_R               (*((volatile uint32_t *)0x00000C17))

//*****************************************************************************
//
// PIE registers (PIE)
//
//*****************************************************************************
#define PIE_CTRL_R                  (*((volatile uint32_t *)0x00000CE0))
#define PIE_ACK_R                   (*((volatile uint32_t *)0x00000CE1))
#define PIE_IER1_R                  (*((volatile uint32_t *)0x00000CE2))
#define PIE_IFR1_R                  (*((volatile uint32_t *)0x00000CE3))
#define PIE_IER2_R                  (*((volatile uint32_t *)0x00000CE4))
#define PIE_IFR2_R                  (*((volatile uint32_t *)0x00000CE5))
#define PIE_IER3_R                  (*((volatile uint32_t *)0x00000CE6))
#define PIE_IFR3_R                  (*((volatile uint32_t *)0x00000CE7))
#define PIE_IER4_R                  (*((volatile uint32_t *)0x00000CE8))
#define PIE_IFR4_R                  (*((volatile uint32_t *)0x00000CE9))
#define PIE_IER5_R                  (*((volatile uint32_t *)0x00000CEA))
#define PIE_IFR5_R                  (*((volatile uint32_t *)0x00000CEB))
#define PIE_IER6_R                  (*((volatile uint32_t *)0x00000CEC))
#define PIE_IFR6_R                  (*((volatile uint32_t *)0x00000CED))
#define PIE_IER7_R                  (*((volatile uint32_t *)0x00000CEE))
#define PIE_IFR7_R                  (*((volatile uint32_t *)0x00000CEF))
#define PIE_IER8_R                  (*((volatile uint32_t *)0x00000CF0))
#define PIE_IFR8_R                  (*((volatile uint32_t *)0x00000CF1))
#define PIE_IER9_R                  (*((volatile uint32_t *)0x00000CF2))
#define PIE_IFR9_R                  (*((volatile uint32_t *)0x00000CF3))
#define PIE_IER10_R                 (*((volatile uint32_t *)0x00000CF4))
#define PIE_IFR10_R                 (*((volatile uint32_t *)0x00000CF5))
#define PIE_IER11_R                 (*((volatile uint32_t *)0x00000CF6))
#define PIE_IFR11_R                 (*((volatile uint32_t *)0x00000CF7))
#define PIE_IER12_R                 (*((volatile uint32_t *)0x00000CF8))
#define PIE_IFR12_R                 (*((volatile uint32_t *)0x00000CF9))

//*****************************************************************************
//
// CPU Interrupt registers ()
//
//*****************************************************************************
#define INT13_CPUTIMER1_R           (*((volatile uint32_t *)0x00000D1A))
#define INT14_CPUTIMER2_R           (*((volatile uint32_t *)0x00000D1C))

//*****************************************************************************
//
// Interrupt Addresses (PIE Interrupt Vector)
//
//*****************************************************************************
#define INT1_1_ADCA1_R              (*((volatile uint32_t *)0x00000D40))
#define INT1_2_ADCB1_R              (*((volatile uint32_t *)0x00000D42))
#define INT1_3_ADCC1_R              (*((volatile uint32_t *)0x00000D44))
#define INT1_4_XINT1_R              (*((volatile uint32_t *)0x00000D46))
#define INT1_5_XINT2_R              (*((volatile uint32_t *)0x00000D48))
#define INT1_6_ADCD1_R              (*((volatile uint32_t *)0x00000D4A))
#define INT1_7_TIMER0_R             (*((volatile uint32_t *)0x00000D4C))
#define INT1_8_WAKE_R               (*((volatile uint32_t *)0x00000D4E))
#define INT1_13_IPC1_R              (*((volatile uint32_t *)0x00000E08))
#define INT1_14_IPC2_R              (*((volatile uint32_t *)0x00000E0A))
#define INT1_15_IPC3_R              (*((volatile uint32_t *)0x00000E0C))
#define INT1_16_IPC4_R              (*((volatile uint32_t *)0x00000E0E))

#define INT2_1_EPWM1TZ_R            (*((volatile uint32_t *)0x00000D50))
#define INT2_2_EPWM2TZ_R            (*((volatile uint32_t *)0x00000D52))
#define INT2_3_EPWM3TZ_R            (*((volatile uint32_t *)0x00000D54))
#define INT2_4_EPWM4TZ_R            (*((volatile uint32_t *)0x00000D56))
#define INT2_5_EPWM5TZ_R            (*((volatile uint32_t *)0x00000D58))
#define INT2_6_EPWM6TZ_R            (*((volatile uint32_t *)0x00000D5A))
#define INT2_7_EPWM7TZ_R            (*((volatile uint32_t *)0x00000D5C))
#define INT2_8_EPWM8TZ_R            (*((volatile uint32_t *)0x00000D5E))
#define INT2_9_EPWM9TZ_R            (*((volatile uint32_t *)0x00000E10))
#define INT2_10_EPWM10TZ_R          (*((volatile uint32_t *)0x00000E12))
#define INT2_11_EPWM11TZ_R          (*((volatile uint32_t *)0x00000E14))
#define INT2_12_EPWM12TZ_R          (*((volatile uint32_t *)0x00000E16))

