Daniel9719/Emotion_Detector_UNAM/CCS/Sensor_Testing_Files/tms320f28379d.h
#define INT3_1_EPWM1_R              (*((volatile uint32_t *)0x00000D60))
#define INT3_2_EPWM2_R              (*((volatile uint32_t *)0x00000D62))
#define INT3_3_EPWM3_R              (*((volatile uint32_t *)0x00000D64))
#define INT3_4_EPWM4_R              (*((volatile uint32_t *)0x00000D66))
#define INT3_5_EPWM5_R              (*((volatile uint32_t *)0x00000D68))
#define INT3_6_EPWM6_R              (*((volatile uint32_t *)0x00000D6A))
#define INT3_7_EPWM7_R              (*((volatile uint32_t *)0x00000D6C))
#define INT3_8_EPWM8_R              (*((volatile uint32_t *)0x00000D6E))
#define INT3_9_EPWM9_R              (*((volatile uint32_t *)0x00000E20))
#define INT3_10_EPWM10_R            (*((volatile uint32_t *)0x00000E22))
#define INT3_11_EPWM11_R            (*((volatile uint32_t *)0x00000E24))
#define INT3_12_EPWM12_R            (*((volatile uint32_t *)0x00000E26))

#define INT4_1_ECAP1_R              (*((volatile uint32_t *)0x00000D70))
#define INT4_2_ECAP2_R              (*((volatile uint32_t *)0x00000D72))
#define INT4_3_ECAP3_R              (*((volatile uint32_t *)0x00000D74))
#define INT4_4_ECAP4_R              (*((volatile uint32_t *)0x00000D76))
#define INT4_5_ECAP5_R              (*((volatile uint32_t *)0x00000D78))
#define INT4_6_ECAP6_R              (*((volatile uint32_t *)0x00000D7A))

#define INT5_1_EQEP1_R              (*((volatile uint32_t *)0x00000D80))
#define INT5_2_EQEP1_R              (*((volatile uint32_t *)0x00000D82))
#define INT5_3_EQEP1_R              (*((volatile uint32_t *)0x00000D84))
#define INT5_5_CLB1_R               (*((volatile uint32_t *)0x00000D88))
#define INT5_6_CLB2_R               (*((volatile uint32_t *)0x00000D8A))
#define INT5_7_CLB3_R               (*((volatile uint32_t *)0x00000D8C))
#define INT5_8_CLB4_R               (*((volatile uint32_t *)0x00000D8E))
#define INT5_9_SD1_R                (*((volatile uint32_t *)0x00000E40))
#define INT5_10_SD2_R               (*((volatile uint32_t *)0x00000E42))

#define INT6_1_SPIARX_R             (*((volatile uint32_t *)0x00000D90))
#define INT6_2_SPIATX_R             (*((volatile uint32_t *)0x00000D92))
#define INT6_3_SPIBRX_R             (*((volatile uint32_t *)0x00000D94))
#define INT6_4_SPIBTX_R             (*((volatile uint32_t *)0x00000D96))
#define INT6_5_MCBSPARX_R           (*((volatile uint32_t *)0x00000D98))
#define INT6_6_MCBSPATX_R           (*((volatile uint32_t *)0x00000D9A))
#define INT6_7_MCBSPBRX_R           (*((volatile uint32_t *)0x00000D9C))
#define INT6_8_MCBSPBTX_R           (*((volatile uint32_t *)0x00000D9E))
#define INT6_9_SPICRX_R             (*((volatile uint32_t *)0x00000E50))
#define INT6_10_SPICTX_R            (*((volatile uint32_t *)0x00000E52))

#define INT7_1_DMACH1_R             (*((volatile uint32_t *)0x00000DA0))
#define INT7_2_DMACH2_R             (*((volatile uint32_t *)0x00000DA2))
#define INT7_1_DMACH3_R             (*((volatile uint32_t *)0x00000DA4))
#define INT7_4_DMACH4_R             (*((volatile uint32_t *)0x00000DA6))
#define INT7_5_DMACH5_R             (*((volatile uint32_t *)0x00000DA8))
#define INT7_6_DMACH6_R             (*((volatile uint32_t *)0x00000DAA))

#define INT8_1_I2CA_R               (*((volatile uint32_t *)0x00000DB0))
#define INT8_2_I2CAFIFO_R           (*((volatile uint32_t *)0x00000DB2))
#define INT8_3_I2CB_R               (*((volatile uint32_t *)0x00000DB4))
#define INT8_4_I2CFIFO_R            (*((volatile uint32_t *)0x00000DB6))
#define INT8_5_SCICRX_R             (*((volatile uint32_t *)0x00000DB8))
#define INT8_6_SCICTX_R             (*((volatile uint32_t *)0x00000DBA))
#define INT8_7_SCIDTX_R             (*((volatile uint32_t *)0x00000DBC))
#define INT8_8_SCIDRX_R             (*((volatile uint32_t *)0x00000DBE))
#define INT8_13_UPPA_R              (*((volatile uint32_t *)0x00000E7C))

#define INT9_1_SCIARX_R             (*((volatile uint32_t *)0x00000DC0))
#define INT9_2_SCIATX_R             (*((volatile uint32_t *)0x00000DC2))
#define INT9_3_SCIBRX_R             (*((volatile uint32_t *)0x00000DC4))
#define INT9_4_SCIBTX_R             (*((volatile uint32_t *)0x00000DC6))
#define INT9_5_CANA0_R              (*((volatile uint32_t *)0x00000DC8))
#define INT9_6_CANA1_R              (*((volatile uint32_t *)0x00000DCA))
#define INT9_7_CANB0_R              (*((volatile uint32_t *)0x00000DCC))
#define INT9_8_CANB1_R              (*((volatile uint32_t *)0x00000DCE))
#define INT9_15_USBA_R              (*((volatile uint32_t *)0x00000E8C))

#define INT11_1_CLA1_1_R            (*((volatile uint32_t *)0x00000DE0))
#define INT11_2_CLA1_2_R            (*((volatile uint32_t *)0x00000DE2))
#define INT11_3_CLA1_3_R            (*((volatile uint32_t *)0x00000DE4))
#define INT11_4_CLA1_4_R            (*((volatile uint32_t *)0x00000DE6))
#define INT11_5_CLA1_5_R            (*((volatile uint32_t *)0x00000DE8))
#define INT11_6_CLA1_6_R            (*((volatile uint32_t *)0x00000DEA))
#define INT11_7_CLA1_7_R            (*((volatile uint32_t *)0x00000DEC))
#define INT11_8_CLA1_8_R            (*((volatile uint32_t *)0x00000DEE))

#define INT12_1_XINT3_R             (*((volatile uint32_t *)0x00000DF0))
#define INT12_2_XINT4_R             (*((volatile uint32_t *)0x00000DF0))
#define INT12_3_XINT5_R             (*((volatile uint32_t *)0x00000DF0))
#define INT12_6_VCU_R               (*((volatile uint32_t *)0x00000DF0))
#define INT12_7_FPU_OVERFLOW_R      (*((volatile uint32_t *)0x00000DF0))
#define INT12_8_FPU_UNDERFLOW_R     (*((volatile uint32_t *)0x00000DF0))
#define INT12_9_EMIF_ERROR_R        (*((volatile uint32_t *)0x00000DF0))
#define INT12_10_RAM_CORRECTABLE_ERROR_R      (*((volatile uint32_t *)0x00000DF0))
#define INT12_11_FLASH_CORRECTABLE_ERROR_R    (*((volatile uint32_t *)0x00000DF0))
#define INT12_12_RAM_ACCESS_VIOLATION_R       (*((volatile uint32_t *)0x00000DF0))
#define INT12_13_SYS_PLL_SLIP_R     (*((volatile uint32_t *)0x00000DF0))
#define INT12_14_AUX_PLL_SLIP_R     (*((volatile uint32_t *)0x00000DF0))
#define INT12_15_CLA_OVERFLOW_R     (*((volatile uint32_t *)0x00000DF0))
#define INT12_16_CLA_UNDERFLOW_R    (*((volatile uint32_t *)0x00000DF0))





//*****************************************************************************
//
// DMA Registers (DMA_REGS)
//
//*****************************************************************************
#define DMA_DMACTRL_R               (*((volatile uint32_t *)0x00001000))
#define DMA_DEBUGCTRL_R             (*((volatile uint32_t *)0x00001001))
#define DMA_PRIORITYCTRL1_R         (*((volatile uint32_t *)0x00001004))
#define DMA_PRIORITYSTAT_R          (*((volatile uint32_t *)0x00001006))

#define DMA_CH1_MODE_R              (*((volatile uint32_t *)0x00001020))
#define DMA_CH1_CONTROL_R           (*((volatile uint32_t *)0x00001021))
#define DMA_CH1_BURSTSIZE_R         (*((volatile uint32_t *)0x00001022))
#define DMA_CH1_BURSTCOUNT_R        (*((volatile uint32_t *)0x00001023))
#define DMA_CH1_SRCBURSTSTEP_R      (*((volatile uint32_t *)0x00001024))
#define DMA_CH1_DSTBUSRTSTEP_R      (*((volatile uint32_t *)0x00001025))
#define DMA_CH1_TRANSFERSIZE_R      (*((volatile uint32_t *)0x00001026))
#define DMA_CH1_TRANSFERCOUNT_R     (*((volatile uint32_t *)0x00001027))
#define DMA_CH1_SRCTRANSFERSTEP_R   (*((volatile uint32_t *)0x00001028))
#define DMA_CH1_DSTTRANSFERSTEP_R   (*((volatile uint32_t *)0x00001029))
#define DMA_CH1_SRCWRAPSIZE_R       (*((volatile uint32_t *)0x0000102A))
#define DMA_CH1_SRCWRAPCOUNT_R      (*((volatile uint32_t *)0x0000102B))
#define DMA_CH1_SRCWRAPSTEP_R       (*((volatile uint32_t *)0x0000102C))
#define DMA_CH1_DSTWRAPSIZE_R       (*((volatile uint32_t *)0x0000102D))
#define DMA_CH1_DSTWRAPCOUNT_R      (*((volatile uint32_t *)0x0000102E))
#define DMA_CH1_DSTWRAPSTEP_R       (*((volatile uint32_t *)0x0000102F))
#define DMA_CH1_SRCBEGADDRSHADOW_R  (*((volatile uint32_t *)0x00001030))
#define DMA_CH1_SRCADDRSHADOW_R     (*((volatile uint32_t *)0x00001032))
#define DMA_CH1_SRCBEGADDRACTIVE_R  (*((volatile uint32_t *)0x00001034))
#define DMA_CH1_SRCADDRACTIVE_R     (*((volatile uint32_t *)0x00001036))
#define DMA_CH1_DSTBEGADDRSHADOW_R  (*((volatile uint32_t *)0x00001038))
#define DMA_CH1_DSTADDRESHADOW_R    (*((volatile uint32_t *)0x0000103A))
#define DMA_CH1_DSTBEGADDRACTIVE_R  (*((volatile uint32_t *)0x0000103C))
#define DMA_CH1_DSTADDRACTIVE_R     (*((volatile uint32_t *)0x0000103E))

