Daniel9719/Emotion_Detector_UNAM/CCS/Sensor_Testing_Files/tms320f28379d.h
#define DMA_CH2_MODE_R              (*((volatile uint32_t *)0x00001040))
#define DMA_CH2_CONTROL_R           (*((volatile uint32_t *)0x00001041))
#define DMA_CH2_BURSTSIZE_R         (*((volatile uint32_t *)0x00001042))
#define DMA_CH2_BURSTCOUNT_R        (*((volatile uint32_t *)0x00001043))
#define DMA_CH2_SRCBURSTSTEP_R      (*((volatile uint32_t *)0x00001044))
#define DMA_CH2_DSTBUSRTSTEP_R      (*((volatile uint32_t *)0x00001045))
#define DMA_CH2_TRANSFERSIZE_R      (*((volatile uint32_t *)0x00001046))
#define DMA_CH2_TRANSFERCOUNT_R     (*((volatile uint32_t *)0x00001047))
#define DMA_CH2_SRCTRANSFERSTEP_R   (*((volatile uint32_t *)0x00001048))
#define DMA_CH2_DSTTRANSFERSTEP_R   (*((volatile uint32_t *)0x00001049))
#define DMA_CH2_SRCWRAPSIZE_R       (*((volatile uint32_t *)0x0000104A))
#define DMA_CH2_SRCWRAPCOUNT_R      (*((volatile uint32_t *)0x0000104B))
#define DMA_CH2_SRCWRAPSTEP_R       (*((volatile uint32_t *)0x0000104C))
#define DMA_CH2_DSTWRAPSIZE_R       (*((volatile uint32_t *)0x0000104D))
#define DMA_CH2_DSTWRAPCOUNT_R      (*((volatile uint32_t *)0x0000104E))
#define DMA_CH2_DSTWRAPSTEP_R       (*((volatile uint32_t *)0x0000104F))
#define DMA_CH2_SRCBEGADDRSHADOW_R  (*((volatile uint32_t *)0x00001050))
#define DMA_CH2_SRCADDRSHADOW_R     (*((volatile uint32_t *)0x00001052))
#define DMA_CH2_SRCBEGADDRACTIVE_R  (*((volatile uint32_t *)0x00001054))
#define DMA_CH2_SRCADDRACTIVE_R     (*((volatile uint32_t *)0x00001056))
#define DMA_CH2_DSTBEGADDRSHADOW_R  (*((volatile uint32_t *)0x00001058))
#define DMA_CH2_DSTADDRESHADOW_R    (*((volatile uint32_t *)0x0000105A))
#define DMA_CH2_DSTBEGADDRACTIVE_R  (*((volatile uint32_t *)0x0000105C))
#define DMA_CH2_DSTADDRACTIVE_R     (*((volatile uint32_t *)0x0000105E))

#define DMA_CH3_MODE_R              (*((volatile uint32_t *)0x00001060))
#define DMA_CH3_CONTROL_R           (*((volatile uint32_t *)0x00001061))
#define DMA_CH3_BURSTSIZE_R         (*((volatile uint32_t *)0x00001062))
#define DMA_CH3_BURSTCOUNT_R        (*((volatile uint32_t *)0x00001063))
#define DMA_CH3_SRCBURSTSTEP_R      (*((volatile uint32_t *)0x00001064))
#define DMA_CH3_DSTBUSRTSTEP_R      (*((volatile uint32_t *)0x00001065))
#define DMA_CH3_TRANSFERSIZE_R      (*((volatile uint32_t *)0x00001066))
#define DMA_CH3_TRANSFERCOUNT_R     (*((volatile uint32_t *)0x00001067))
#define DMA_CH3_SRCTRANSFERSTEP_R   (*((volatile uint32_t *)0x00001068))
#define DMA_CH3_DSTTRANSFERSTEP_R   (*((volatile uint32_t *)0x00001069))
#define DMA_CH3_SRCWRAPSIZE_R       (*((volatile uint32_t *)0x0000106A))
#define DMA_CH3_SRCWRAPCOUNT_R      (*((volatile uint32_t *)0x0000106B))
#define DMA_CH3_SRCWRAPSTEP_R       (*((volatile uint32_t *)0x0000106C))
#define DMA_CH3_DSTWRAPSIZE_R       (*((volatile uint32_t *)0x0000106D))
#define DMA_CH3_DSTWRAPCOUNT_R      (*((volatile uint32_t *)0x0000106E))
#define DMA_CH3_DSTWRAPSTEP_R       (*((volatile uint32_t *)0x0000106F))
#define DMA_CH3_SRCBEGADDRSHADOW_R  (*((volatile uint32_t *)0x00001070))
#define DMA_CH3_SRCADDRSHADOW_R     (*((volatile uint32_t *)0x00001072))
#define DMA_CH3_SRCBEGADDRACTIVE_R  (*((volatile uint32_t *)0x00001074))
#define DMA_CH3_SRCADDRACTIVE_R     (*((volatile uint32_t *)0x00001076))
#define DMA_CH3_DSTBEGADDRSHADOW_R  (*((volatile uint32_t *)0x00001078))
#define DMA_CH3_DSTADDRESHADOW_R    (*((volatile uint32_t *)0x0000107A))
#define DMA_CH3_DSTBEGADDRACTIVE_R  (*((volatile uint32_t *)0x0000107C))
#define DMA_CH3_DSTADDRACTIVE_R     (*((volatile uint32_t *)0x0000107E))

#define DMA_CH4_MODE_R              (*((volatile uint32_t *)0x00001080))
#define DMA_CH4_CONTROL_R           (*((volatile uint32_t *)0x00001081))
#define DMA_CH4_BURSTSIZE_R         (*((volatile uint32_t *)0x00001082))
#define DMA_CH4_BURSTCOUNT_R        (*((volatile uint32_t *)0x00001083))
#define DMA_CH4_SRCBURSTSTEP_R      (*((volatile uint32_t *)0x00001084))
#define DMA_CH4_DSTBUSRTSTEP_R      (*((volatile uint32_t *)0x00001085))
#define DMA_CH4_TRANSFERSIZE_R      (*((volatile uint32_t *)0x00001086))
#define DMA_CH4_TRANSFERCOUNT_R     (*((volatile uint32_t *)0x00001087))
#define DMA_CH4_SRCTRANSFERSTEP_R   (*((volatile uint32_t *)0x00001088))
#define DMA_CH4_DSTTRANSFERSTEP_R   (*((volatile uint32_t *)0x00001089))
#define DMA_CH4_SRCWRAPSIZE_R       (*((volatile uint32_t *)0x0000108A))
#define DMA_CH4_SRCWRAPCOUNT_R      (*((volatile uint32_t *)0x0000108B))
#define DMA_CH4_SRCWRAPSTEP_R       (*((volatile uint32_t *)0x0000108C))
#define DMA_CH4_DSTWRAPSIZE_R       (*((volatile uint32_t *)0x0000108D))
#define DMA_CH4_DSTWRAPCOUNT_R      (*((volatile uint32_t *)0x0000108E))
#define DMA_CH4_DSTWRAPSTEP_R       (*((volatile uint32_t *)0x0000108F))
#define DMA_CH4_SRCBEGADDRSHADOW_R  (*((volatile uint32_t *)0x00001090))
#define DMA_CH4_SRCADDRSHADOW_R     (*((volatile uint32_t *)0x00001092))
#define DMA_CH4_SRCBEGADDRACTIVE_R  (*((volatile uint32_t *)0x00001094))
#define DMA_CH4_SRCADDRACTIVE_R     (*((volatile uint32_t *)0x00001096))
#define DMA_CH4_DSTBEGADDRSHADOW_R  (*((volatile uint32_t *)0x00001098))
#define DMA_CH4_DSTADDRESHADOW_R    (*((volatile uint32_t *)0x0000109A))
#define DMA_CH4_DSTBEGADDRACTIVE_R  (*((volatile uint32_t *)0x0000109C))
#define DMA_CH4_DSTADDRACTIVE_R     (*((volatile uint32_t *)0x0000109E))

#define DMA_CH5_MODE_R              (*((volatile uint32_t *)0x000010A0))
#define DMA_CH5_CONTROL_R           (*((volatile uint32_t *)0x000010A1))
#define DMA_CH5_BURSTSIZE_R         (*((volatile uint32_t *)0x000010A2))
#define DMA_CH5_BURSTCOUNT_R        (*((volatile uint32_t *)0x000010A3))
#define DMA_CH5_SRCBURSTSTEP_R      (*((volatile uint32_t *)0x000010A4))
#define DMA_CH5_DSTBUSRTSTEP_R      (*((volatile uint32_t *)0x000010A5))
#define DMA_CH5_TRANSFERSIZE_R      (*((volatile uint32_t *)0x000010A6))
#define DMA_CH5_TRANSFERCOUNT_R     (*((volatile uint32_t *)0x000010A7))
#define DMA_CH5_SRCTRANSFERSTEP_R   (*((volatile uint32_t *)0x000010A8))
#define DMA_CH5_DSTTRANSFERSTEP_R   (*((volatile uint32_t *)0x000010A9))
#define DMA_CH5_SRCWRAPSIZE_R       (*((volatile uint32_t *)0x000010AA))
#define DMA_CH5_SRCWRAPCOUNT_R      (*((volatile uint32_t *)0x000010AB))
#define DMA_CH5_SRCWRAPSTEP_R       (*((volatile uint32_t *)0x000010AC))
#define DMA_CH5_DSTWRAPSIZE_R       (*((volatile uint32_t *)0x000010AD))
#define DMA_CH5_DSTWRAPCOUNT_R      (*((volatile uint32_t *)0x000010AE))
#define DMA_CH5_DSTWRAPSTEP_R       (*((volatile uint32_t *)0x000010AF))
#define DMA_CH5_SRCBEGADDRSHADOW_R  (*((volatile uint32_t *)0x000010B0))
#define DMA_CH5_SRCADDRSHADOW_R     (*((volatile uint32_t *)0x000010B2))
#define DMA_CH5_SRCBEGADDRACTIVE_R  (*((volatile uint32_t *)0x000010B4))
#define DMA_CH5_SRCADDRACTIVE_R     (*((volatile uint32_t *)0x000010B6))
#define DMA_CH5_DSTBEGADDRSHADOW_R  (*((volatile uint32_t *)0x000010B8))
#define DMA_CH5_DSTADDRESHADOW_R    (*((volatile uint32_t *)0x000010BA))
#define DMA_CH5_DSTBEGADDRACTIVE_R  (*((volatile uint32_t *)0x000010BC))
#define DMA_CH5_DSTADDRACTIVE_R     (*((volatile uint32_t *)0x000010BE))

