Daniel9719/Emotion_Detector_UNAM/CCS/Sensor_Testing_Files/tms320f28379d.h
#define DMA_CH6_MODE_R              (*((volatile uint32_t *)0x000010C0))
#define DMA_CH6_CONTROL_R           (*((volatile uint32_t *)0x000010C1))
#define DMA_CH6_BURSTSIZE_R         (*((volatile uint32_t *)0x000010C2))
#define DMA_CH6_BURSTCOUNT_R        (*((volatile uint32_t *)0x000010C3))
#define DMA_CH6_SRCBURSTSTEP_R      (*((volatile uint32_t *)0x000010C4))
#define DMA_CH6_DSTBUSRTSTEP_R      (*((volatile uint32_t *)0x000010C5))
#define DMA_CH6_TRANSFERSIZE_R      (*((volatile uint32_t *)0x000010C6))
#define DMA_CH6_TRANSFERCOUNT_R     (*((volatile uint32_t *)0x000010C7))
#define DMA_CH6_SRCTRANSFERSTEP_R   (*((volatile uint32_t *)0x000010C8))
#define DMA_CH6_DSTTRANSFERSTEP_R   (*((volatile uint32_t *)0x000010C9))
#define DMA_CH6_SRCWRAPSIZE_R       (*((volatile uint32_t *)0x000010CA))
#define DMA_CH6_SRCWRAPCOUNT_R      (*((volatile uint32_t *)0x000010CB))
#define DMA_CH6_SRCWRAPSTEP_R       (*((volatile uint32_t *)0x000010CC))
#define DMA_CH6_DSTWRAPSIZE_R       (*((volatile uint32_t *)0x000010CD))
#define DMA_CH6_DSTWRAPCOUNT_R      (*((volatile uint32_t *)0x000010CE))
#define DMA_CH6_DSTWRAPSTEP_R       (*((volatile uint32_t *)0x000010CF))
#define DMA_CH6_SRCBEGADDRSHADOW_R  (*((volatile uint32_t *)0x000010D0))
#define DMA_CH6_SRCADDRSHADOW_R     (*((volatile uint32_t *)0x000010D2))
#define DMA_CH6_SRCBEGADDRACTIVE_R  (*((volatile uint32_t *)0x000010D4))
#define DMA_CH6_SRCADDRACTIVE_R     (*((volatile uint32_t *)0x000010D6))
#define DMA_CH6_DSTBEGADDRSHADOW_R  (*((volatile uint32_t *)0x000010D8))
#define DMA_CH6_DSTADDRESHADOW_R    (*((volatile uint32_t *)0x000010DA))
#define DMA_CH6_DSTBEGADDRACTIVE_R  (*((volatile uint32_t *)0x000010DC))
#define DMA_CH6_DSTADDRACTIVE_R     (*((volatile uint32_t *)0x000010DE))

//*****************************************************************************
//
// CLA Registers (CLA_REGS)
//
//*****************************************************************************
#define CLA_MVECT1_R                (*((volatile uint32_t *)0x00001400))
#define CLA_MVECT2_R                (*((volatile uint32_t *)0x00001401))
#define CLA_MVECT3_R                (*((volatile uint32_t *)0x00001402))
#define CLA_MVECT4_R                (*((volatile uint32_t *)0x00001403))
#define CLA_MVECT5_R                (*((volatile uint32_t *)0x00001404))
#define CLA_MVECT6_R                (*((volatile uint32_t *)0x00001405))
#define CLA_MVECT7_R                (*((volatile uint32_t *)0x00001406))
#define CLA_MVECT8_R                (*((volatile uint32_t *)0x00001407))
#define CLA_MCTL_R                  (*((volatile uint32_t *)0x00001410))
#define CLA_MIFR_R                  (*((volatile uint32_t *)0x00001420))
#define CLA_MIOVF_R                 (*((volatile uint32_t *)0x00001421))
#define CLA_MIFRC_R                 (*((volatile uint32_t *)0x00001422))
#define CLA_MICLR_R                 (*((volatile uint32_t *)0x00001423))
#define CLA_MICLROVF_R              (*((volatile uint32_t *)0x00001424))
#define CLA_MIER_R                  (*((volatile uint32_t *)0x00001425))
#define CLA_MIRUN_R                 (*((volatile uint32_t *)0x00001426))

#define CLA_SOFTINTEN_R             (*((volatile uint32_t *)0x00000CE0))
#define CLA_SOFTINTFRC_R            (*((volatile uint32_t *)0x00000CE2))

//*****************************************************************************
//
// ePWM Register 1 (EPWM_REGS 1)
//
//*****************************************************************************
#define EPWM1_TBCTL_R               (*((volatile uint32_t *)0x00004000))
#define EPWM1_TBCTL2_R              (*((volatile uint32_t *)0x00004001))
#define EPWM1_TBCTR_R               (*((volatile uint32_t *)0x00004004))
#define EPWM1_TBSTS_R               (*((volatile uint32_t *)0x00004005))
#define EPWM1_CMPCTL_R              (*((volatile uint32_t *)0x00004008))
#define EPWM1_CMPCTL2_R             (*((volatile uint32_t *)0x00004009))
#define EPWM1_DBCTL_R               (*((volatile uint32_t *)0x0000400C))
#define EPWM1_DBCTL2_R              (*((volatile uint32_t *)0x0000400D))
#define EPWM1_AQCTL_R               (*((volatile uint32_t *)0x00004010))
#define EPWM1_AQTSRCSEL_R           (*((volatile uint32_t *)0x00004011))
#define EPWM1_PCCTL_R               (*((volatile uint32_t *)0x00004014))
#define EPWM1_VCAPCTL_R             (*((volatile uint32_t *)0x00004018))
#define EPWM1_VCNTCFG_R             (*((volatile uint32_t *)0x00004019))
#define EPWM1_HRCNFG_R              (*((volatile uint32_t *)0x00004020))
#define EPWM1_HRPWR_R               (*((volatile uint32_t *)0x00004021))
#define EPWM1_HRMSTEP_R             (*((volatile uint32_t *)0x00004026))
#define EPWM1_HRCNFG2_R             (*((volatile uint32_t *)0x00004027))
#define EPWM1_HRPCTL_R              (*((volatile uint32_t *)0x0000402D))
#define EPWM1_TRREM_R               (*((volatile uint32_t *)0x0000402E))
#define EPWM1_GLDCTL_R              (*((volatile uint32_t *)0x00004034))
#define EPWM1_GLDCFG_R              (*((volatile uint32_t *)0x00004035))
#define EPWM1_EPWMXLINK_R           (*((volatile uint32_t *)0x00004038))
#define EPWM1_AQCTLA_R              (*((volatile uint32_t *)0x00004040))
#define EPWM1_AQCTLA2_R             (*((volatile uint32_t *)0x00004041))
#define EPWM1_AQCTLB_R              (*((volatile uint32_t *)0x00004042))
#define EPWM1_AQCTLB2_R             (*((volatile uint32_t *)0x00004043))
#define EPWM1_AQSFRC_R              (*((volatile uint32_t *)0x00004047))
#define EPWM1_AQCSFRC_R             (*((volatile uint32_t *)0x00004049))
#define EPWM1_DBREDHR_R             (*((volatile uint32_t *)0x00004050))
#define EPWM1_DBRED_R               (*((volatile uint32_t *)0x00004051))
#define EPWM1_DBFEDHR_R             (*((volatile uint32_t *)0x00004052))
#define EPWM1_DBFED_R               (*((volatile uint32_t *)0x00004053))
#define EPWM1_TBPHS_R               (*((volatile uint32_t *)0x00004060))
#define EPWM1_TBPRDHR_R             (*((volatile uint32_t *)0x00004062))
#define EPWM1_TBPRD_R               (*((volatile uint32_t *)0x00004063))
#define EPWM1_CMPA_R                (*((volatile uint32_t *)0x0000406A))
#define EPWM1_CMPB_R                (*((volatile uint32_t *)0x0000406C))
#define EPWM1_CMPC_R                (*((volatile uint32_t *)0x0000406F))
#define EPWM1_CMPD_R                (*((volatile uint32_t *)0x00004071))
#define EPWM1_GLDCTL2_R             (*((volatile uint32_t *)0x00004074))
#define EPWM1_SWVDELVAL_R           (*((volatile uint32_t *)0x00004077))
#define EPWM1_TZSEL_R               (*((volatile uint32_t *)0x00004080))
#define EPWM1_TZDCSEL_R             (*((volatile uint32_t *)0x00004082))
#define EPWM1_TZCTL_R               (*((volatile uint32_t *)0x00004084))
#define EPWM1_TZCTL2_R              (*((volatile uint32_t *)0x00004085))
#define EPWM1_TZCTLDCA_R            (*((volatile uint32_t *)0x00004086))
#define EPWM1_TZCTLDCB_R            (*((volatile uint32_t *)0x00004087))
#define EPWM1_TZEINT_R              (*((volatile uint32_t *)0x0000408D))
#define EPWM1_TZFLG_R               (*((volatile uint32_t *)0x00004093))
#define EPWM1_TZCBCFLG_R            (*((volatile uint32_t *)0x00004094))
#define EPWM1_TZOSTFLG_R            (*((volatile uint32_t *)0x00004095))
#define EPWM1_TZCLR_R               (*((volatile uint32_t *)0x00004097))
#define EPWM1_TZCBCCLR_R            (*((volatile uint32_t *)0x00004098))
#define EPWM1_TZOSTCLR_R            (*((volatile uint32_t *)0x00004099))
#define EPWM1_TZFRC_R               (*((volatile uint32_t *)0x0000409B))
#define EPWM1_ETSEL_R               (*((volatile uint32_t *)0x000040A4))
#define EPWM1_ETPS_R                (*((volatile uint32_t *)0x000040A6))
#define EPWM1_ETFLG_R               (*((volatile uint32_t *)0x000040A8))
#define EPWM1_ETCLR_R               (*((volatile uint32_t *)0x000040AA))
#define EPWM1_ETFRC_R               (*((volatile uint32_t *)0x000040AC))
#define EPWM1_ETINTPS_R             (*((volatile uint32_t *)0x000040AE))
#define EPWM1_ETSOCPS_R             (*((volatile uint32_t *)0x000040B0))
#define EPWM1_ETCNTINITCTL_R        (*((volatile uint32_t *)0x000040B2))
#define EPWM1_ETCNTINT_R            (*((volatile uint32_t *)0x000040B4))
#define EPWM1_DCTRIPSEL_R           (*((volatile uint32_t *)0x000040C0))
#define EPWM1_DCACTL_R              (*((volatile uint32_t *)0x000040C3))
#define EPWM1_DCBCTL_R              (*((volatile uint32_t *)0x000040C4))
#define EPWM1_DCFCTL_R              (*((volatile uint32_t *)0x000040C7))
#define EPWM1_DCCAPCTL_R            (*((volatile uint32_t *)0x000040C8))
#define EPWM1_DCFOFFSET_R           (*((volatile uint32_t *)0x000040C9))
#define EPWM1_DCFOFFSETCNT_R        (*((volatile uint32_t *)0x000040CA))
#define EPWM1_DCFWINDOW_R           (*((volatile uint32_t *)0x000040CB))
#define EPWM1_DCFWINDOWCNT_R        (*((volatile uint32_t *)0x000040CC))
#define EPWM1_DCCAP_R               (*((volatile uint32_t *)0x000040CF))
#define EPWM1_DCAHTRIPSEL_R         (*((volatile uint32_t *)0x000040D2))
#define EPWM1_DCALTRIPSEL_R         (*((volatile uint32_t *)0x000040D3))
#define EPWM1_DCBHTRIPSEL_R         (*((volatile uint32_t *)0x000040D4))
#define EPWM1_DCBLTRIPSEL_R         (*((volatile uint32_t *)0x000040D5))
#define EPWM1_HWVDELVAL_R           (*((volatile uint32_t *)0x000040FD))
#define EPWM1_VCNTVAL_R             (*((volatile uint32_t *)0x000040FE))

//*****************************************************************************
//
// ePWM Register 2 (EPWM_REGS 2)
//
//*****************************************************************************
#define EPMW2_TBCTL_R               (*((volatile uint32_t *)0x00004100))
#define EPMW2_TBCTL2_R              (*((volatile uint32_t *)0x00004101))
#define EPMW2_TBCTR_R               (*((volatile uint32_t *)0x00004104))
#define EPMW2_TBSTS_R               (*((volatile uint32_t *)0x00004105))
#define EPMW2_CMPCTL_R              (*((volatile uint32_t *)0x00004108))
#define EPMW2_CMPCTL2_R             (*((volatile uint32_t *)0x00004109))
#define EPMW2_DBCTL_R               (*((volatile uint32_t *)0x0000410C))
#define EPMW2_DBCTL2_R              (*((volatile uint32_t *)0x0000410D))
#define EPMW2_AQCTL_R               (*((volatile uint32_t *)0x00004110))
#define EPMW2_AQTSRCSEL_R           (*((volatile uint32_t *)0x00004111))
#define EPMW2_PCCTL_R               (*((volatile uint32_t *)0x00004114))
#define EPMW2_VCAPCTL_R             (*((volatile uint32_t *)0x00004118))
#define EPMW2_VCNTCFG_R             (*((volatile uint32_t *)0x00004119))
#define EPMW2_HRCNFG_R              (*((volatile uint32_t *)0x00004120))
#define EPMW2_HRPWR_R               (*((volatile uint32_t *)0x00004121))
#define EPMW2_HRMSTEP_R             (*((volatile uint32_t *)0x00004126))
#define EPMW2_HRCNFG2_R             (*((volatile uint32_t *)0x00004127))
#define EPMW2_HRPCTL_R              (*((volatile uint32_t *)0x0000412D))
#define EPMW2_TRREM_R               (*((volatile uint32_t *)0x0000412E))
#define EPMW2_GLDCTL_R              (*((volatile uint32_t *)0x00004134))
#define EPMW2_GLDCFG_R              (*((volatile uint32_t *)0x00004135))
#define EPMW2_EPWMXLINK_R           (*((volatile uint32_t *)0x00004138))
#define EPMW2_AQCTLA_R              (*((volatile uint32_t *)0x00004140))
#define EPMW2_AQCTLA2_R             (*((volatile uint32_t *)0x00004141))
#define EPMW2_AQCTLB_R              (*((volatile uint32_t *)0x00004142))
#define EPMW2_AQCTLB2_R             (*((volatile uint32_t *)0x00004143))
#define EPMW2_AQSFRC_R              (*((volatile uint32_t *)0x00004147))
#define EPMW2_AQCSFRC_R             (*((volatile uint32_t *)0x00004149))
#define EPMW2_DBREDHR_R             (*((volatile uint32_t *)0x00004150))
#define EPMW2_DBRED_R               (*((volatile uint32_t *)0x00004151))
#define EPMW2_DBFEDHR_R             (*((volatile uint32_t *)0x00004152))
#define EPMW2_DBFED_R               (*((volatile uint32_t *)0x00004153))
#define EPMW2_TBPHS_R               (*((volatile uint32_t *)0x00004160))
#define EPMW2_TBPRDHR_R             (*((volatile uint32_t *)0x00004162))
#define EPMW2_TBPRD_R               (*((volatile uint32_t *)0x00004163))
#define EPMW2_CMPA_R                (*((volatile uint32_t *)0x0000416A))
#define EPMW2_CMPB_R                (*((volatile uint32_t *)0x0000416C))
#define EPMW2_CMPC_R                (*((volatile uint32_t *)0x0000416F))
#define EPMW2_CMPD_R                (*((volatile uint32_t *)0x00004171))
#define EPMW2_GLDCTL2_R             (*((volatile uint32_t *)0x00004174))
#define EPMW2_SWVDELVAL_R           (*((volatile uint32_t *)0x00004177))
#define EPMW2_TZSEL_R               (*((volatile uint32_t *)0x00004180))
#define EPMW2_TZDCSEL_R             (*((volatile uint32_t *)0x00004182))
#define EPMW2_TZCTL_R               (*((volatile uint32_t *)0x00004184))
#define EPMW2_TZCTL2_R              (*((volatile uint32_t *)0x00004185))
#define EPMW2_TZCTLDCA_R            (*((volatile uint32_t *)0x00004186))
#define EPMW2_TZCTLDCB_R            (*((volatile uint32_t *)0x00004187))
#define EPMW2_TZEINT_R              (*((volatile uint32_t *)0x0000418D))
#define EPMW2_TZFLG_R               (*((volatile uint32_t *)0x00004193))
#define EPMW2_TZCBCFLG_R            (*((volatile uint32_t *)0x00004194))
#define EPMW2_TZOSTFLG_R            (*((volatile uint32_t *)0x00004195))
#define EPMW2_TZCLR_R               (*((volatile uint32_t *)0x00004197))
#define EPMW2_TZCBCCLR_R            (*((volatile uint32_t *)0x00004198))
#define EPMW2_TZOSTCLR_R            (*((volatile uint32_t *)0x00004199))
#define EPMW2_TZFRC_R               (*((volatile uint32_t *)0x0000419B))
#define EPMW2_ETSEL_R               (*((volatile uint32_t *)0x000041A4))
#define EPMW2_ETPS_R                (*((volatile uint32_t *)0x000041A6))
#define EPMW2_ETFLG_R               (*((volatile uint32_t *)0x000041A8))
#define EPMW2_ETCLR_R               (*((volatile uint32_t *)0x000041AA))
#define EPMW2_ETFRC_R               (*((volatile uint32_t *)0x000041AC))
#define EPMW2_ETINTPS_R             (*((volatile uint32_t *)0x000041AE))
#define EPMW2_ETSOCPS_R             (*((volatile uint32_t *)0x000041B0))
#define EPMW2_ETCNTINITCTL_R        (*((volatile uint32_t *)0x000041B2))
#define EPMW2_ETCNTINT_R            (*((volatile uint32_t *)0x000041B4))
#define EPMW2_DCTRIPSEL_R           (*((volatile uint32_t *)0x000041C0))
#define EPMW2_DCACTL_R              (*((volatile uint32_t *)0x000041C3))
#define EPMW2_DCBCTL_R              (*((volatile uint32_t *)0x000041C4))
#define EPMW2_DCFCTL_R              (*((volatile uint32_t *)0x000041C7))
#define EPMW2_DCCAPCTL_R            (*((volatile uint32_t *)0x000041C8))
#define EPMW2_DCFOFFSET_R           (*((volatile uint32_t *)0x000041C9))
#define EPMW2_DCFOFFSETCNT_R        (*((volatile uint32_t *)0x000041CA))
#define EPMW2_DCFWINDOW_R           (*((volatile uint32_t *)0x000041CB))
#define EPMW2_DCFWINDOWCNT_R        (*((volatile uint32_t *)0x000041CC))
#define EPMW2_DCCAP_R               (*((volatile uint32_t *)0x000041CF))
#define EPMW2_DCAHTRIPSEL_R         (*((volatile uint32_t *)0x000041D2))
#define EPMW2_DCALTRIPSEL_R         (*((volatile uint32_t *)0x000041D3))
#define EPMW2_DCBHTRIPSEL_R         (*((volatile uint32_t *)0x000041D4))
#define EPMW2_DCBLTRIPSEL_R         (*((volatile uint32_t *)0x000041D5))
#define EPMW2_HWVDELVAL_R           (*((volatile uint32_t *)0x000041FD))
#define EPMW2_VCNTVAL_R             (*((volatile uint32_t *)0x000041FE))

//*****************************************************************************
//
// ePWM Register 3 (EPWM_REGS 3)
//
//*****************************************************************************
#define EPMW3_TBCTL_R               (*((volatile uint32_t *)0x00004200))
#define EPMW3_TBCTL2_R              (*((volatile uint32_t *)0x00004201))
#define EPMW3_TBCTR_R               (*((volatile uint32_t *)0x00004204))
#define EPMW3_TBSTS_R               (*((volatile uint32_t *)0x00004205))
#define EPMW3_CMPCTL_R              (*((volatile uint32_t *)0x00004208))
#define EPMW3_CMPCTL2_R             (*((volatile uint32_t *)0x00004209))
#define EPMW3_DBCTL_R               (*((volatile uint32_t *)0x0000420C))
#define EPMW3_DBCTL2_R              (*((volatile uint32_t *)0x0000420D))
#define EPMW3_AQCTL_R               (*((volatile uint32_t *)0x00004210))
#define EPMW3_AQTSRCSEL_R           (*((volatile uint32_t *)0x00004211))
#define EPMW3_PCCTL_R               (*((volatile uint32_t *)0x00004214))
#define EPMW3_VCAPCTL_R             (*((volatile uint32_t *)0x00004218))
#define EPMW3_VCNTCFG_R             (*((volatile uint32_t *)0x00004219))
#define EPMW3_HRCNFG_R              (*((volatile uint32_t *)0x00004220))
#define EPMW3_HRPWR_R               (*((volatile uint32_t *)0x00004221))
#define EPMW3_HRMSTEP_R             (*((volatile uint32_t *)0x00004226))
#define EPMW3_HRCNFG2_R             (*((volatile uint32_t *)0x00004227))
#define EPMW3_HRPCTL_R              (*((volatile uint32_t *)0x0000422D))
#define EPMW3_TRREM_R               (*((volatile uint32_t *)0x0000422E))
#define EPMW3_GLDCTL_R              (*((volatile uint32_t *)0x00004234))
#define EPMW3_GLDCFG_R              (*((volatile uint32_t *)0x00004235))
#define EPMW3_EPWMXLINK_R           (*((volatile uint32_t *)0x00004238))
#define EPMW3_AQCTLA_R              (*((volatile uint32_t *)0x00004240))
#define EPMW3_AQCTLA2_R             (*((volatile uint32_t *)0x00004241))
#define EPMW3_AQCTLB_R              (*((volatile uint32_t *)0x00004242))
#define EPMW3_AQCTLB2_R             (*((volatile uint32_t *)0x00004243))
#define EPMW3_AQSFRC_R              (*((volatile uint32_t *)0x00004247))
#define EPMW3_AQCSFRC_R             (*((volatile uint32_t *)0x00004249))
#define EPMW3_DBREDHR_R             (*((volatile uint32_t *)0x00004250))
#define EPMW3_DBRED_R               (*((volatile uint32_t *)0x00004251))
#define EPMW3_DBFEDHR_R             (*((volatile uint32_t *)0x00004252))
#define EPMW3_DBFED_R               (*((volatile uint32_t *)0x00004253))
#define EPMW3_TBPHS_R               (*((volatile uint32_t *)0x00004260))
#define EPMW3_TBPRDHR_R             (*((volatile uint32_t *)0x00004262))
#define EPMW3_TBPRD_R               (*((volatile uint32_t *)0x00004263))
#define EPMW3_CMPA_R                (*((volatile uint32_t *)0x0000426A))
#define EPMW3_CMPB_R                (*((volatile uint32_t *)0x0000426C))
#define EPMW3_CMPC_R                (*((volatile uint32_t *)0x0000426F))
#define EPMW3_CMPD_R                (*((volatile uint32_t *)0x00004271))
#define EPMW3_GLDCTL2_R             (*((volatile uint32_t *)0x00004274))
#define EPMW3_SWVDELVAL_R           (*((volatile uint32_t *)0x00004277))
#define EPMW3_TZSEL_R               (*((volatile uint32_t *)0x00004280))
#define EPMW3_TZDCSEL_R             (*((volatile uint32_t *)0x00004282))
#define EPMW3_TZCTL_R               (*((volatile uint32_t *)0x00004284))
#define EPMW3_TZCTL2_R              (*((volatile uint32_t *)0x00004285))
#define EPMW3_TZCTLDCA_R            (*((volatile uint32_t *)0x00004286))
#define EPMW3_TZCTLDCB_R            (*((volatile uint32_t *)0x00004287))
#define EPMW3_TZEINT_R              (*((volatile uint32_t *)0x0000428D))
#define EPMW3_TZFLG_R               (*((volatile uint32_t *)0x00004293))
#define EPMW3_TZCBCFLG_R            (*((volatile uint32_t *)0x00004294))
#define EPMW3_TZOSTFLG_R            (*((volatile uint32_t *)0x00004295))
#define EPMW3_TZCLR_R               (*((volatile uint32_t *)0x00004297))
#define EPMW3_TZCBCCLR_R            (*((volatile uint32_t *)0x00004298))
#define EPMW3_TZOSTCLR_R            (*((volatile uint32_t *)0x00004299))
#define EPMW3_TZFRC_R               (*((volatile uint32_t *)0x0000429B))
#define EPMW3_ETSEL_R               (*((volatile uint32_t *)0x000042A4))
#define EPMW3_ETPS_R                (*((volatile uint32_t *)0x000042A6))
#define EPMW3_ETFLG_R               (*((volatile uint32_t *)0x000042A8))
#define EPMW3_ETCLR_R               (*((volatile uint32_t *)0x000042AA))
#define EPMW3_ETFRC_R               (*((volatile uint32_t *)0x000042AC))
#define EPMW3_ETINTPS_R             (*((volatile uint32_t *)0x000042AE))
#define EPMW3_ETSOCPS_R             (*((volatile uint32_t *)0x000042B0))
#define EPMW3_ETCNTINITCTL_R        (*((volatile uint32_t *)0x000042B2))
#define EPMW3_ETCNTINT_R            (*((volatile uint32_t *)0x000042B4))
#define EPMW3_DCTRIPSEL_R           (*((volatile uint32_t *)0x000042C0))
#define EPMW3_DCACTL_R              (*((volatile uint32_t *)0x000042C3))
#define EPMW3_DCBCTL_R              (*((volatile uint32_t *)0x000042C4))
#define EPMW3_DCFCTL_R              (*((volatile uint32_t *)0x000042C7))
#define EPMW3_DCCAPCTL_R            (*((volatile uint32_t *)0x000042C8))
#define EPMW3_DCFOFFSET_R           (*((volatile uint32_t *)0x000042C9))
#define EPMW3_DCFOFFSETCNT_R        (*((volatile uint32_t *)0x000042CA))
#define EPMW3_DCFWINDOW_R           (*((volatile uint32_t *)0x000042CB))
#define EPMW3_DCFWINDOWCNT_R        (*((volatile uint32_t *)0x000042CC))
#define EPMW3_DCCAP_R               (*((volatile uint32_t *)0x000042CF))
#define EPMW3_DCAHTRIPSEL_R         (*((volatile uint32_t *)0x000042D2))
#define EPMW3_DCALTRIPSEL_R         (*((volatile uint32_t *)0x000042D3))
#define EPMW3_DCBHTRIPSEL_R         (*((volatile uint32_t *)0x000042D4))
#define EPMW3_DCBLTRIPSEL_R         (*((volatile uint32_t *)0x000042D5))
#define EPMW3_HWVDELVAL_R           (*((volatile uint32_t *)0x000042FD))
#define EPMW3_VCNTVAL_R             (*((volatile uint32_t *)0x000042FE))

