Daniel9719/Emotion_Detector_UNAM/CCS/Sensor_Testing_Files/tms320f28379d.h
//*****************************************************************************
//
// ePWM Register 4 (EPWM_REGS 4)
//
//*****************************************************************************
#define EPMW4_TBCTL_R               (*((volatile uint32_t *)0x00004300))
#define EPMW4_TBCTL2_R              (*((volatile uint32_t *)0x00004301))
#define EPMW4_TBCTR_R               (*((volatile uint32_t *)0x00004304))
#define EPMW4_TBSTS_R               (*((volatile uint32_t *)0x00004305))
#define EPMW4_CMPCTL_R              (*((volatile uint32_t *)0x00004308))
#define EPMW4_CMPCTL2_R             (*((volatile uint32_t *)0x00004309))
#define EPMW4_DBCTL_R               (*((volatile uint32_t *)0x0000430C))
#define EPMW4_DBCTL2_R              (*((volatile uint32_t *)0x0000430D))
#define EPMW4_AQCTL_R               (*((volatile uint32_t *)0x00004310))
#define EPMW4_AQTSRCSEL_R           (*((volatile uint32_t *)0x00004311))
#define EPMW4_PCCTL_R               (*((volatile uint32_t *)0x00004314))
#define EPMW4_VCAPCTL_R             (*((volatile uint32_t *)0x00004318))
#define EPMW4_VCNTCFG_R             (*((volatile uint32_t *)0x00004319))
#define EPMW4_HRCNFG_R              (*((volatile uint32_t *)0x00004320))
#define EPMW4_HRPWR_R               (*((volatile uint32_t *)0x00004321))
#define EPMW4_HRMSTEP_R             (*((volatile uint32_t *)0x00004326))
#define EPMW4_HRCNFG2_R             (*((volatile uint32_t *)0x00004327))
#define EPMW4_HRPCTL_R              (*((volatile uint32_t *)0x0000432D))
#define EPMW4_TRREM_R               (*((volatile uint32_t *)0x0000432E))
#define EPMW4_GLDCTL_R              (*((volatile uint32_t *)0x00004334))
#define EPMW4_GLDCFG_R              (*((volatile uint32_t *)0x00004335))
#define EPMW4_EPWMXLINK_R           (*((volatile uint32_t *)0x00004338))
#define EPMW4_AQCTLA_R              (*((volatile uint32_t *)0x00004340))
#define EPMW4_AQCTLA2_R             (*((volatile uint32_t *)0x00004341))
#define EPMW4_AQCTLB_R              (*((volatile uint32_t *)0x00004342))
#define EPMW4_AQCTLB2_R             (*((volatile uint32_t *)0x00004343))
#define EPMW4_AQSFRC_R              (*((volatile uint32_t *)0x00004347))
#define EPMW4_AQCSFRC_R             (*((volatile uint32_t *)0x00004349))
#define EPMW4_DBREDHR_R             (*((volatile uint32_t *)0x00004350))
#define EPMW4_DBRED_R               (*((volatile uint32_t *)0x00004351))
#define EPMW4_DBFEDHR_R             (*((volatile uint32_t *)0x00004352))
#define EPMW4_DBFED_R               (*((volatile uint32_t *)0x00004353))
#define EPMW4_TBPHS_R               (*((volatile uint32_t *)0x00004360))
#define EPMW4_TBPRDHR_R             (*((volatile uint32_t *)0x00004362))
#define EPMW4_TBPRD_R               (*((volatile uint32_t *)0x00004363))
#define EPMW4_CMPA_R                (*((volatile uint32_t *)0x0000436A))
#define EPMW4_CMPB_R                (*((volatile uint32_t *)0x0000436C))
#define EPMW4_CMPC_R                (*((volatile uint32_t *)0x0000436F))
#define EPMW4_CMPD_R                (*((volatile uint32_t *)0x00004371))
#define EPMW4_GLDCTL2_R             (*((volatile uint32_t *)0x00004374))
#define EPMW4_SWVDELVAL_R           (*((volatile uint32_t *)0x00004377))
#define EPMW4_TZSEL_R               (*((volatile uint32_t *)0x00004380))
#define EPMW4_TZDCSEL_R             (*((volatile uint32_t *)0x00004382))
#define EPMW4_TZCTL_R               (*((volatile uint32_t *)0x00004384))
#define EPMW4_TZCTL2_R              (*((volatile uint32_t *)0x00004385))
#define EPMW4_TZCTLDCA_R            (*((volatile uint32_t *)0x00004386))
#define EPMW4_TZCTLDCB_R            (*((volatile uint32_t *)0x00004387))
#define EPMW4_TZEINT_R              (*((volatile uint32_t *)0x0000438D))
#define EPMW4_TZFLG_R               (*((volatile uint32_t *)0x00004393))
#define EPMW4_TZCBCFLG_R            (*((volatile uint32_t *)0x00004394))
#define EPMW4_TZOSTFLG_R            (*((volatile uint32_t *)0x00004395))
#define EPMW4_TZCLR_R               (*((volatile uint32_t *)0x00004397))
#define EPMW4_TZCBCCLR_R            (*((volatile uint32_t *)0x00004398))
#define EPMW4_TZOSTCLR_R            (*((volatile uint32_t *)0x00004399))
#define EPMW4_TZFRC_R               (*((volatile uint32_t *)0x0000439B))
#define EPMW4_ETSEL_R               (*((volatile uint32_t *)0x000043A4))
#define EPMW4_ETPS_R                (*((volatile uint32_t *)0x000043A6))
#define EPMW4_ETFLG_R               (*((volatile uint32_t *)0x000043A8))
#define EPMW4_ETCLR_R               (*((volatile uint32_t *)0x000043AA))
#define EPMW4_ETFRC_R               (*((volatile uint32_t *)0x000043AC))
#define EPMW4_ETINTPS_R             (*((volatile uint32_t *)0x000043AE))
#define EPMW4_ETSOCPS_R             (*((volatile uint32_t *)0x000043B0))
#define EPMW4_ETCNTINITCTL_R        (*((volatile uint32_t *)0x000043B2))
#define EPMW4_ETCNTINT_R            (*((volatile uint32_t *)0x000043B4))
#define EPMW4_DCTRIPSEL_R           (*((volatile uint32_t *)0x000043C0))
#define EPMW4_DCACTL_R              (*((volatile uint32_t *)0x000043C3))
#define EPMW4_DCBCTL_R              (*((volatile uint32_t *)0x000043C4))
#define EPMW4_DCFCTL_R              (*((volatile uint32_t *)0x000043C7))
#define EPMW4_DCCAPCTL_R            (*((volatile uint32_t *)0x000043C8))
#define EPMW4_DCFOFFSET_R           (*((volatile uint32_t *)0x000043C9))
#define EPMW4_DCFOFFSETCNT_R        (*((volatile uint32_t *)0x000043CA))
#define EPMW4_DCFWINDOW_R           (*((volatile uint32_t *)0x000043CB))
#define EPMW4_DCFWINDOWCNT_R        (*((volatile uint32_t *)0x000043CC))
#define EPMW4_DCCAP_R               (*((volatile uint32_t *)0x000043CF))
#define EPMW4_DCAHTRIPSEL_R         (*((volatile uint32_t *)0x000043D2))
#define EPMW4_DCALTRIPSEL_R         (*((volatile uint32_t *)0x000043D3))
#define EPMW4_DCBHTRIPSEL_R         (*((volatile uint32_t *)0x000043D4))
#define EPMW4_DCBLTRIPSEL_R         (*((volatile uint32_t *)0x000043D5))
#define EPMW4_HWVDELVAL_R           (*((volatile uint32_t *)0x000043FD))
#define EPMW4_VCNTVAL_R             (*((volatile uint32_t *)0x000043FE))

//*****************************************************************************
//
// ePWM Register 5 (EPWM_REGS 5)
//
//*****************************************************************************
#define EPMW5_TBCTL_R               (*((volatile uint32_t *)0x00004400))
#define EPMW5_TBCTL2_R              (*((volatile uint32_t *)0x00004401))
#define EPMW5_TBCTR_R               (*((volatile uint32_t *)0x00004404))
#define EPMW5_TBSTS_R               (*((volatile uint32_t *)0x00004405))
#define EPMW5_CMPCTL_R              (*((volatile uint32_t *)0x00004408))
#define EPMW5_CMPCTL2_R             (*((volatile uint32_t *)0x00004409))
#define EPMW5_DBCTL_R               (*((volatile uint32_t *)0x0000440C))
#define EPMW5_DBCTL2_R              (*((volatile uint32_t *)0x0000440D))
#define EPMW5_AQCTL_R               (*((volatile uint32_t *)0x00004410))
#define EPMW5_AQTSRCSEL_R           (*((volatile uint32_t *)0x00004411))
#define EPMW5_PCCTL_R               (*((volatile uint32_t *)0x00004414))
#define EPMW5_VCAPCTL_R             (*((volatile uint32_t *)0x00004418))
#define EPMW5_VCNTCFG_R             (*((volatile uint32_t *)0x00004419))
#define EPMW5_HRCNFG_R              (*((volatile uint32_t *)0x00004420))
#define EPMW5_HRPWR_R               (*((volatile uint32_t *)0x00004421))
#define EPMW5_HRMSTEP_R             (*((volatile uint32_t *)0x00004426))
#define EPMW5_HRCNFG2_R             (*((volatile uint32_t *)0x00004427))
#define EPMW5_HRPCTL_R              (*((volatile uint32_t *)0x0000442D))
#define EPMW5_TRREM_R               (*((volatile uint32_t *)0x0000442E))
#define EPMW5_GLDCTL_R              (*((volatile uint32_t *)0x00004434))
#define EPMW5_GLDCFG_R              (*((volatile uint32_t *)0x00004435))
#define EPMW5_EPWMXLINK_R           (*((volatile uint32_t *)0x00004438))
#define EPMW5_AQCTLA_R              (*((volatile uint32_t *)0x00004440))
#define EPMW5_AQCTLA2_R             (*((volatile uint32_t *)0x00004441))
#define EPMW5_AQCTLB_R              (*((volatile uint32_t *)0x00004442))
#define EPMW5_AQCTLB2_R             (*((volatile uint32_t *)0x00004443))
#define EPMW5_AQSFRC_R              (*((volatile uint32_t *)0x00004447))
#define EPMW5_AQCSFRC_R             (*((volatile uint32_t *)0x00004449))
#define EPMW5_DBREDHR_R             (*((volatile uint32_t *)0x00004450))
#define EPMW5_DBRED_R               (*((volatile uint32_t *)0x00004451))
#define EPMW5_DBFEDHR_R             (*((volatile uint32_t *)0x00004452))
#define EPMW5_DBFED_R               (*((volatile uint32_t *)0x00004453))
#define EPMW5_TBPHS_R               (*((volatile uint32_t *)0x00004460))
#define EPMW5_TBPRDHR_R             (*((volatile uint32_t *)0x00004462))
#define EPMW5_TBPRD_R               (*((volatile uint32_t *)0x00004463))
#define EPMW5_CMPA_R                (*((volatile uint32_t *)0x0000446A))
#define EPMW5_CMPB_R                (*((volatile uint32_t *)0x0000446C))
#define EPMW5_CMPC_R                (*((volatile uint32_t *)0x0000446F))
#define EPMW5_CMPD_R                (*((volatile uint32_t *)0x00004471))
#define EPMW5_GLDCTL2_R             (*((volatile uint32_t *)0x00004474))
#define EPMW5_SWVDELVAL_R           (*((volatile uint32_t *)0x00004477))
#define EPMW5_TZSEL_R               (*((volatile uint32_t *)0x00004480))
#define EPMW5_TZDCSEL_R             (*((volatile uint32_t *)0x00004482))
#define EPMW5_TZCTL_R               (*((volatile uint32_t *)0x00004484))
#define EPMW5_TZCTL2_R              (*((volatile uint32_t *)0x00004485))
#define EPMW5_TZCTLDCA_R            (*((volatile uint32_t *)0x00004486))
#define EPMW5_TZCTLDCB_R            (*((volatile uint32_t *)0x00004487))
#define EPMW5_TZEINT_R              (*((volatile uint32_t *)0x0000448D))
#define EPMW5_TZFLG_R               (*((volatile uint32_t *)0x00004493))
#define EPMW5_TZCBCFLG_R            (*((volatile uint32_t *)0x00004494))
#define EPMW5_TZOSTFLG_R            (*((volatile uint32_t *)0x00004495))
#define EPMW5_TZCLR_R               (*((volatile uint32_t *)0x00004497))
#define EPMW5_TZCBCCLR_R            (*((volatile uint32_t *)0x00004498))
#define EPMW5_TZOSTCLR_R            (*((volatile uint32_t *)0x00004499))
#define EPMW5_TZFRC_R               (*((volatile uint32_t *)0x0000449B))
#define EPMW5_ETSEL_R               (*((volatile uint32_t *)0x000044A4))
#define EPMW5_ETPS_R                (*((volatile uint32_t *)0x000044A6))
#define EPMW5_ETFLG_R               (*((volatile uint32_t *)0x000044A8))
#define EPMW5_ETCLR_R               (*((volatile uint32_t *)0x000044AA))
#define EPMW5_ETFRC_R               (*((volatile uint32_t *)0x000044AC))
#define EPMW5_ETINTPS_R             (*((volatile uint32_t *)0x000044AE))
#define EPMW5_ETSOCPS_R             (*((volatile uint32_t *)0x000044B0))
#define EPMW5_ETCNTINITCTL_R        (*((volatile uint32_t *)0x000044B2))
#define EPMW5_ETCNTINT_R            (*((volatile uint32_t *)0x000044B4))
#define EPMW5_DCTRIPSEL_R           (*((volatile uint32_t *)0x000044C0))
#define EPMW5_DCACTL_R              (*((volatile uint32_t *)0x000044C3))
#define EPMW5_DCBCTL_R              (*((volatile uint32_t *)0x000044C4))
#define EPMW5_DCFCTL_R              (*((volatile uint32_t *)0x000044C7))
#define EPMW5_DCCAPCTL_R            (*((volatile uint32_t *)0x000044C8))
#define EPMW5_DCFOFFSET_R           (*((volatile uint32_t *)0x000044C9))
#define EPMW5_DCFOFFSETCNT_R        (*((volatile uint32_t *)0x000044CA))
#define EPMW5_DCFWINDOW_R           (*((volatile uint32_t *)0x000044CB))
#define EPMW5_DCFWINDOWCNT_R        (*((volatile uint32_t *)0x000044CC))
#define EPMW5_DCCAP_R               (*((volatile uint32_t *)0x000044CF))
#define EPMW5_DCAHTRIPSEL_R         (*((volatile uint32_t *)0x000044D2))
#define EPMW5_DCALTRIPSEL_R         (*((volatile uint32_t *)0x000044D3))
#define EPMW5_DCBHTRIPSEL_R         (*((volatile uint32_t *)0x000044D4))
#define EPMW5_DCBLTRIPSEL_R         (*((volatile uint32_t *)0x000044D5))
#define EPMW5_HWVDELVAL_R           (*((volatile uint32_t *)0x000044FD))
#define EPMW5_VCNTVAL_R             (*((volatile uint32_t *)0x000044FE))

//*****************************************************************************
//
// ePWM Register 6 (EPWM_REGS 6)
//
//*****************************************************************************
#define EPMW6_TBCTL_R               (*((volatile uint32_t *)0x00004500))
#define EPMW6_TBCTL2_R              (*((volatile uint32_t *)0x00004501))
#define EPMW6_TBCTR_R               (*((volatile uint32_t *)0x00004504))
#define EPMW6_TBSTS_R               (*((volatile uint32_t *)0x00004505))
#define EPMW6_CMPCTL_R              (*((volatile uint32_t *)0x00004508))
#define EPMW6_CMPCTL2_R             (*((volatile uint32_t *)0x00004509))
#define EPMW6_DBCTL_R               (*((volatile uint32_t *)0x0000450C))
#define EPMW6_DBCTL2_R              (*((volatile uint32_t *)0x0000450D))
#define EPMW6_AQCTL_R               (*((volatile uint32_t *)0x00004510))
#define EPMW6_AQTSRCSEL_R           (*((volatile uint32_t *)0x00004511))
#define EPMW6_PCCTL_R               (*((volatile uint32_t *)0x00004514))
#define EPMW6_VCAPCTL_R             (*((volatile uint32_t *)0x00004518))
#define EPMW6_VCNTCFG_R             (*((volatile uint32_t *)0x00004519))
#define EPMW6_HRCNFG_R              (*((volatile uint32_t *)0x00004520))
#define EPMW6_HRPWR_R               (*((volatile uint32_t *)0x00004521))
#define EPMW6_HRMSTEP_R             (*((volatile uint32_t *)0x00004526))
#define EPMW6_HRCNFG2_R             (*((volatile uint32_t *)0x00004527))
#define EPMW6_HRPCTL_R              (*((volatile uint32_t *)0x0000452D))
#define EPMW6_TRREM_R               (*((volatile uint32_t *)0x0000452E))
#define EPMW6_GLDCTL_R              (*((volatile uint32_t *)0x00004534))
#define EPMW6_GLDCFG_R              (*((volatile uint32_t *)0x00004535))
#define EPMW6_EPWMXLINK_R           (*((volatile uint32_t *)0x00004538))
#define EPMW6_AQCTLA_R              (*((volatile uint32_t *)0x00004540))
#define EPMW6_AQCTLA2_R             (*((volatile uint32_t *)0x00004541))
#define EPMW6_AQCTLB_R              (*((volatile uint32_t *)0x00004542))
#define EPMW6_AQCTLB2_R             (*((volatile uint32_t *)0x00004543))
#define EPMW6_AQSFRC_R              (*((volatile uint32_t *)0x00004547))
#define EPMW6_AQCSFRC_R             (*((volatile uint32_t *)0x00004549))
#define EPMW6_DBREDHR_R             (*((volatile uint32_t *)0x00004550))
#define EPMW6_DBRED_R               (*((volatile uint32_t *)0x00004551))
#define EPMW6_DBFEDHR_R             (*((volatile uint32_t *)0x00004552))
#define EPMW6_DBFED_R               (*((volatile uint32_t *)0x00004553))
#define EPMW6_TBPHS_R               (*((volatile uint32_t *)0x00004560))
#define EPMW6_TBPRDHR_R             (*((volatile uint32_t *)0x00004562))
#define EPMW6_TBPRD_R               (*((volatile uint32_t *)0x00004563))
#define EPMW6_CMPA_R                (*((volatile uint32_t *)0x0000456A))
#define EPMW6_CMPB_R                (*((volatile uint32_t *)0x0000456C))
#define EPMW6_CMPC_R                (*((volatile uint32_t *)0x0000456F))
#define EPMW6_CMPD_R                (*((volatile uint32_t *)0x00004571))
#define EPMW6_GLDCTL2_R             (*((volatile uint32_t *)0x00004574))
#define EPMW6_SWVDELVAL_R           (*((volatile uint32_t *)0x00004577))
#define EPMW6_TZSEL_R               (*((volatile uint32_t *)0x00004580))
#define EPMW6_TZDCSEL_R             (*((volatile uint32_t *)0x00004582))
#define EPMW6_TZCTL_R               (*((volatile uint32_t *)0x00004584))
#define EPMW6_TZCTL2_R              (*((volatile uint32_t *)0x00004585))
#define EPMW6_TZCTLDCA_R            (*((volatile uint32_t *)0x00004586))
#define EPMW6_TZCTLDCB_R            (*((volatile uint32_t *)0x00004587))
#define EPMW6_TZEINT_R              (*((volatile uint32_t *)0x0000458D))
#define EPMW6_TZFLG_R               (*((volatile uint32_t *)0x00004593))
#define EPMW6_TZCBCFLG_R            (*((volatile uint32_t *)0x00004594))
#define EPMW6_TZOSTFLG_R            (*((volatile uint32_t *)0x00004595))
#define EPMW6_TZCLR_R               (*((volatile uint32_t *)0x00004597))
#define EPMW6_TZCBCCLR_R            (*((volatile uint32_t *)0x00004598))
#define EPMW6_TZOSTCLR_R            (*((volatile uint32_t *)0x00004599))
#define EPMW6_TZFRC_R               (*((volatile uint32_t *)0x0000459B))
#define EPMW6_ETSEL_R               (*((volatile uint32_t *)0x000045A4))
#define EPMW6_ETPS_R                (*((volatile uint32_t *)0x000045A6))
#define EPMW6_ETFLG_R               (*((volatile uint32_t *)0x000045A8))
#define EPMW6_ETCLR_R               (*((volatile uint32_t *)0x000045AA))
#define EPMW6_ETFRC_R               (*((volatile uint32_t *)0x000045AC))
#define EPMW6_ETINTPS_R             (*((volatile uint32_t *)0x000045AE))
#define EPMW6_ETSOCPS_R             (*((volatile uint32_t *)0x000045B0))
#define EPMW6_ETCNTINITCTL_R        (*((volatile uint32_t *)0x000045B2))
#define EPMW6_ETCNTINT_R            (*((volatile uint32_t *)0x000045B4))
#define EPMW6_DCTRIPSEL_R           (*((volatile uint32_t *)0x000045C0))
#define EPMW6_DCACTL_R              (*((volatile uint32_t *)0x000045C3))
#define EPMW6_DCBCTL_R              (*((volatile uint32_t *)0x000045C4))
#define EPMW6_DCFCTL_R              (*((volatile uint32_t *)0x000045C7))
#define EPMW6_DCCAPCTL_R            (*((volatile uint32_t *)0x000045C8))
#define EPMW6_DCFOFFSET_R           (*((volatile uint32_t *)0x000045C9))
#define EPMW6_DCFOFFSETCNT_R        (*((volatile uint32_t *)0x000045CA))
#define EPMW6_DCFWINDOW_R           (*((volatile uint32_t *)0x000045CB))
#define EPMW6_DCFWINDOWCNT_R        (*((volatile uint32_t *)0x000045CC))
#define EPMW6_DCCAP_R               (*((volatile uint32_t *)0x000045CF))
#define EPMW6_DCAHTRIPSEL_R         (*((volatile uint32_t *)0x000045D2))
#define EPMW6_DCALTRIPSEL_R         (*((volatile uint32_t *)0x000045D3))
#define EPMW6_DCBHTRIPSEL_R         (*((volatile uint32_t *)0x000045D4))
#define EPMW6_DCBLTRIPSEL_R         (*((volatile uint32_t *)0x000045D5))
#define EPMW6_HWVDELVAL_R           (*((volatile uint32_t *)0x000045FD))
#define EPMW6_VCNTVAL_R             (*((volatile uint32_t *)0x000045FE))

