Daniel9719/Emotion_Detector_UNAM/CCS/Sensor_Testing_Files/tms320f28379d.h
//*****************************************************************************
//
// ePWM Register 7 (EPWM_REGS 7)
//
//*****************************************************************************
#define EPMW7_TBCTL_R               (*((volatile uint32_t *)0x00004600))
#define EPMW7_TBCTL2_R              (*((volatile uint32_t *)0x00004601))
#define EPMW7_TBCTR_R               (*((volatile uint32_t *)0x00004604))
#define EPMW7_TBSTS_R               (*((volatile uint32_t *)0x00004605))
#define EPMW7_CMPCTL_R              (*((volatile uint32_t *)0x00004608))
#define EPMW7_CMPCTL2_R             (*((volatile uint32_t *)0x00004609))
#define EPMW7_DBCTL_R               (*((volatile uint32_t *)0x0000460C))
#define EPMW7_DBCTL2_R              (*((volatile uint32_t *)0x0000460D))
#define EPMW7_AQCTL_R               (*((volatile uint32_t *)0x00004610))
#define EPMW7_AQTSRCSEL_R           (*((volatile uint32_t *)0x00004611))
#define EPMW7_PCCTL_R               (*((volatile uint32_t *)0x00004614))
#define EPMW7_VCAPCTL_R             (*((volatile uint32_t *)0x00004618))
#define EPMW7_VCNTCFG_R             (*((volatile uint32_t *)0x00004619))
#define EPMW7_HRCNFG_R              (*((volatile uint32_t *)0x00004620))
#define EPMW7_HRPWR_R               (*((volatile uint32_t *)0x00004621))
#define EPMW7_HRMSTEP_R             (*((volatile uint32_t *)0x00004626))
#define EPMW7_HRCNFG2_R             (*((volatile uint32_t *)0x00004627))
#define EPMW7_HRPCTL_R              (*((volatile uint32_t *)0x0000462D))
#define EPMW7_TRREM_R               (*((volatile uint32_t *)0x0000462E))
#define EPMW7_GLDCTL_R              (*((volatile uint32_t *)0x00004634))
#define EPMW7_GLDCFG_R              (*((volatile uint32_t *)0x00004635))
#define EPMW7_EPWMXLINK_R           (*((volatile uint32_t *)0x00004638))
#define EPMW7_AQCTLA_R              (*((volatile uint32_t *)0x00004640))
#define EPMW7_AQCTLA2_R             (*((volatile uint32_t *)0x00004641))
#define EPMW7_AQCTLB_R              (*((volatile uint32_t *)0x00004642))
#define EPMW7_AQCTLB2_R             (*((volatile uint32_t *)0x00004643))
#define EPMW7_AQSFRC_R              (*((volatile uint32_t *)0x00004647))
#define EPMW7_AQCSFRC_R             (*((volatile uint32_t *)0x00004649))
#define EPMW7_DBREDHR_R             (*((volatile uint32_t *)0x00004650))
#define EPMW7_DBRED_R               (*((volatile uint32_t *)0x00004651))
#define EPMW7_DBFEDHR_R             (*((volatile uint32_t *)0x00004652))
#define EPMW7_DBFED_R               (*((volatile uint32_t *)0x00004653))
#define EPMW7_TBPHS_R               (*((volatile uint32_t *)0x00004660))
#define EPMW7_TBPRDHR_R             (*((volatile uint32_t *)0x00004662))
#define EPMW7_TBPRD_R               (*((volatile uint32_t *)0x00004663))
#define EPMW7_CMPA_R                (*((volatile uint32_t *)0x0000466A))
#define EPMW7_CMPB_R                (*((volatile uint32_t *)0x0000466C))
#define EPMW7_CMPC_R                (*((volatile uint32_t *)0x0000466F))
#define EPMW7_CMPD_R                (*((volatile uint32_t *)0x00004671))
#define EPMW7_GLDCTL2_R             (*((volatile uint32_t *)0x00004674))
#define EPMW7_SWVDELVAL_R           (*((volatile uint32_t *)0x00004677))
#define EPMW7_TZSEL_R               (*((volatile uint32_t *)0x00004680))
#define EPMW7_TZDCSEL_R             (*((volatile uint32_t *)0x00004682))
#define EPMW7_TZCTL_R               (*((volatile uint32_t *)0x00004684))
#define EPMW7_TZCTL2_R              (*((volatile uint32_t *)0x00004685))
#define EPMW7_TZCTLDCA_R            (*((volatile uint32_t *)0x00004686))
#define EPMW7_TZCTLDCB_R            (*((volatile uint32_t *)0x00004687))
#define EPMW7_TZEINT_R              (*((volatile uint32_t *)0x0000468D))
#define EPMW7_TZFLG_R               (*((volatile uint32_t *)0x00004693))
#define EPMW7_TZCBCFLG_R            (*((volatile uint32_t *)0x00004694))
#define EPMW7_TZOSTFLG_R            (*((volatile uint32_t *)0x00004695))
#define EPMW7_TZCLR_R               (*((volatile uint32_t *)0x00004697))
#define EPMW7_TZCBCCLR_R            (*((volatile uint32_t *)0x00004698))
#define EPMW7_TZOSTCLR_R            (*((volatile uint32_t *)0x00004699))
#define EPMW7_TZFRC_R               (*((volatile uint32_t *)0x0000469B))
#define EPMW7_ETSEL_R               (*((volatile uint32_t *)0x000046A4))
#define EPMW7_ETPS_R                (*((volatile uint32_t *)0x000046A6))
#define EPMW7_ETFLG_R               (*((volatile uint32_t *)0x000046A8))
#define EPMW7_ETCLR_R               (*((volatile uint32_t *)0x000046AA))
#define EPMW7_ETFRC_R               (*((volatile uint32_t *)0x000046AC))
#define EPMW7_ETINTPS_R             (*((volatile uint32_t *)0x000046AE))
#define EPMW7_ETSOCPS_R             (*((volatile uint32_t *)0x000046B0))
#define EPMW7_ETCNTINITCTL_R        (*((volatile uint32_t *)0x000046B2))
#define EPMW7_ETCNTINT_R            (*((volatile uint32_t *)0x000046B4))
#define EPMW7_DCTRIPSEL_R           (*((volatile uint32_t *)0x000046C0))
#define EPMW7_DCACTL_R              (*((volatile uint32_t *)0x000046C3))
#define EPMW7_DCBCTL_R              (*((volatile uint32_t *)0x000046C4))
#define EPMW7_DCFCTL_R              (*((volatile uint32_t *)0x000046C7))
#define EPMW7_DCCAPCTL_R            (*((volatile uint32_t *)0x000046C8))
#define EPMW7_DCFOFFSET_R           (*((volatile uint32_t *)0x000046C9))
#define EPMW7_DCFOFFSETCNT_R        (*((volatile uint32_t *)0x000046CA))
#define EPMW7_DCFWINDOW_R           (*((volatile uint32_t *)0x000046CB))
#define EPMW7_DCFWINDOWCNT_R        (*((volatile uint32_t *)0x000046CC))
#define EPMW7_DCCAP_R               (*((volatile uint32_t *)0x000046CF))
#define EPMW7_DCAHTRIPSEL_R         (*((volatile uint32_t *)0x000046D2))
#define EPMW7_DCALTRIPSEL_R         (*((volatile uint32_t *)0x000046D3))
#define EPMW7_DCBHTRIPSEL_R         (*((volatile uint32_t *)0x000046D4))
#define EPMW7_DCBLTRIPSEL_R         (*((volatile uint32_t *)0x000046D5))
#define EPMW7_HWVDELVAL_R           (*((volatile uint32_t *)0x000046FD))
#define EPMW7_VCNTVAL_R             (*((volatile uint32_t *)0x000046FE))

//*****************************************************************************
//
// ePWM Register 8 (EPWM_REGS 8)
//
//*****************************************************************************
#define EPMW8_TBCTL_R               (*((volatile uint32_t *)0x00004700))
#define EPMW8_TBCTL2_R              (*((volatile uint32_t *)0x00004701))
#define EPMW8_TBCTR_R               (*((volatile uint32_t *)0x00004704))
#define EPMW8_TBSTS_R               (*((volatile uint32_t *)0x00004705))
#define EPMW8_CMPCTL_R              (*((volatile uint32_t *)0x00004708))
#define EPMW8_CMPCTL2_R             (*((volatile uint32_t *)0x00004709))
#define EPMW8_DBCTL_R               (*((volatile uint32_t *)0x0000470C))
#define EPMW8_DBCTL2_R              (*((volatile uint32_t *)0x0000470D))
#define EPMW8_AQCTL_R               (*((volatile uint32_t *)0x00004710))
#define EPMW8_AQTSRCSEL_R           (*((volatile uint32_t *)0x00004711))
#define EPMW8_PCCTL_R               (*((volatile uint32_t *)0x00004714))
#define EPMW8_VCAPCTL_R             (*((volatile uint32_t *)0x00004718))
#define EPMW8_VCNTCFG_R             (*((volatile uint32_t *)0x00004719))
#define EPMW8_HRCNFG_R              (*((volatile uint32_t *)0x00004720))
#define EPMW8_HRPWR_R               (*((volatile uint32_t *)0x00004721))
#define EPMW8_HRMSTEP_R             (*((volatile uint32_t *)0x00004726))
#define EPMW8_HRCNFG2_R             (*((volatile uint32_t *)0x00004727))
#define EPMW8_HRPCTL_R              (*((volatile uint32_t *)0x0000472D))
#define EPMW8_TRREM_R               (*((volatile uint32_t *)0x0000472E))
#define EPMW8_GLDCTL_R              (*((volatile uint32_t *)0x00004734))
#define EPMW8_GLDCFG_R              (*((volatile uint32_t *)0x00004735))
#define EPMW8_EPWMXLINK_R           (*((volatile uint32_t *)0x00004738))
#define EPMW8_AQCTLA_R              (*((volatile uint32_t *)0x00004740))
#define EPMW8_AQCTLA2_R             (*((volatile uint32_t *)0x00004741))
#define EPMW8_AQCTLB_R              (*((volatile uint32_t *)0x00004742))
#define EPMW8_AQCTLB2_R             (*((volatile uint32_t *)0x00004743))
#define EPMW8_AQSFRC_R              (*((volatile uint32_t *)0x00004747))
#define EPMW8_AQCSFRC_R             (*((volatile uint32_t *)0x00004749))
#define EPMW8_DBREDHR_R             (*((volatile uint32_t *)0x00004750))
#define EPMW8_DBRED_R               (*((volatile uint32_t *)0x00004751))
#define EPMW8_DBFEDHR_R             (*((volatile uint32_t *)0x00004752))
#define EPMW8_DBFED_R               (*((volatile uint32_t *)0x00004753))
#define EPMW8_TBPHS_R               (*((volatile uint32_t *)0x00004760))
#define EPMW8_TBPRDHR_R             (*((volatile uint32_t *)0x00004762))
#define EPMW8_TBPRD_R               (*((volatile uint32_t *)0x00004763))
#define EPMW8_CMPA_R                (*((volatile uint32_t *)0x0000476A))
#define EPMW8_CMPB_R                (*((volatile uint32_t *)0x0000476C))
#define EPMW8_CMPC_R                (*((volatile uint32_t *)0x0000476F))
#define EPMW8_CMPD_R                (*((volatile uint32_t *)0x00004771))
#define EPMW8_GLDCTL2_R             (*((volatile uint32_t *)0x00004774))
#define EPMW8_SWVDELVAL_R           (*((volatile uint32_t *)0x00004777))
#define EPMW8_TZSEL_R               (*((volatile uint32_t *)0x00004780))
#define EPMW8_TZDCSEL_R             (*((volatile uint32_t *)0x00004782))
#define EPMW8_TZCTL_R               (*((volatile uint32_t *)0x00004784))
#define EPMW8_TZCTL2_R              (*((volatile uint32_t *)0x00004785))
#define EPMW8_TZCTLDCA_R            (*((volatile uint32_t *)0x00004786))
#define EPMW8_TZCTLDCB_R            (*((volatile uint32_t *)0x00004787))
#define EPMW8_TZEINT_R              (*((volatile uint32_t *)0x0000478D))
#define EPMW8_TZFLG_R               (*((volatile uint32_t *)0x00004793))
#define EPMW8_TZCBCFLG_R            (*((volatile uint32_t *)0x00004794))
#define EPMW8_TZOSTFLG_R            (*((volatile uint32_t *)0x00004795))
#define EPMW8_TZCLR_R               (*((volatile uint32_t *)0x00004797))
#define EPMW8_TZCBCCLR_R            (*((volatile uint32_t *)0x00004798))
#define EPMW8_TZOSTCLR_R            (*((volatile uint32_t *)0x00004799))
#define EPMW8_TZFRC_R               (*((volatile uint32_t *)0x0000479B))
#define EPMW8_ETSEL_R               (*((volatile uint32_t *)0x000047A4))
#define EPMW8_ETPS_R                (*((volatile uint32_t *)0x000047A6))
#define EPMW8_ETFLG_R               (*((volatile uint32_t *)0x000047A8))
#define EPMW8_ETCLR_R               (*((volatile uint32_t *)0x000047AA))
#define EPMW8_ETFRC_R               (*((volatile uint32_t *)0x000047AC))
#define EPMW8_ETINTPS_R             (*((volatile uint32_t *)0x000047AE))
#define EPMW8_ETSOCPS_R             (*((volatile uint32_t *)0x000047B0))
#define EPMW8_ETCNTINITCTL_R        (*((volatile uint32_t *)0x000047B2))
#define EPMW8_ETCNTINT_R            (*((volatile uint32_t *)0x000047B4))
#define EPMW8_DCTRIPSEL_R           (*((volatile uint32_t *)0x000047C0))
#define EPMW8_DCACTL_R              (*((volatile uint32_t *)0x000047C3))
#define EPMW8_DCBCTL_R              (*((volatile uint32_t *)0x000047C4))
#define EPMW8_DCFCTL_R              (*((volatile uint32_t *)0x000047C7))
#define EPMW8_DCCAPCTL_R            (*((volatile uint32_t *)0x000047C8))
#define EPMW8_DCFOFFSET_R           (*((volatile uint32_t *)0x000047C9))
#define EPMW8_DCFOFFSETCNT_R        (*((volatile uint32_t *)0x000047CA))
#define EPMW8_DCFWINDOW_R           (*((volatile uint32_t *)0x000047CB))
#define EPMW8_DCFWINDOWCNT_R        (*((volatile uint32_t *)0x000047CC))
#define EPMW8_DCCAP_R               (*((volatile uint32_t *)0x000047CF))
#define EPMW8_DCAHTRIPSEL_R         (*((volatile uint32_t *)0x000047D2))
#define EPMW8_DCALTRIPSEL_R         (*((volatile uint32_t *)0x000047D3))
#define EPMW8_DCBHTRIPSEL_R         (*((volatile uint32_t *)0x000047D4))
#define EPMW8_DCBLTRIPSEL_R         (*((volatile uint32_t *)0x000047D5))
#define EPMW8_HWVDELVAL_R           (*((volatile uint32_t *)0x000047FD))
#define EPMW8_VCNTVAL_R             (*((volatile uint32_t *)0x000047FE))

//*****************************************************************************
//
// ePWM Register 9 (EPWM_REGS 9)
//
//*****************************************************************************
#define EPMW9_TBCTL_R               (*((volatile uint32_t *)0x00004800))
#define EPMW9_TBCTL2_R              (*((volatile uint32_t *)0x00004801))
#define EPMW9_TBCTR_R               (*((volatile uint32_t *)0x00004804))
#define EPMW9_TBSTS_R               (*((volatile uint32_t *)0x00004805))
#define EPMW9_CMPCTL_R              (*((volatile uint32_t *)0x00004808))
#define EPMW9_CMPCTL2_R             (*((volatile uint32_t *)0x00004809))
#define EPMW9_DBCTL_R               (*((volatile uint32_t *)0x0000480C))
#define EPMW9_DBCTL2_R              (*((volatile uint32_t *)0x0000480D))
#define EPMW9_AQCTL_R               (*((volatile uint32_t *)0x00004810))
#define EPMW9_AQTSRCSEL_R           (*((volatile uint32_t *)0x00004811))
#define EPMW9_PCCTL_R               (*((volatile uint32_t *)0x00004814))
#define EPMW9_VCAPCTL_R             (*((volatile uint32_t *)0x00004818))
#define EPMW9_VCNTCFG_R             (*((volatile uint32_t *)0x00004819))
#define EPMW9_HRCNFG_R              (*((volatile uint32_t *)0x00004820))
#define EPMW9_HRPWR_R               (*((volatile uint32_t *)0x00004821))
#define EPMW9_HRMSTEP_R             (*((volatile uint32_t *)0x00004826))
#define EPMW9_HRCNFG2_R             (*((volatile uint32_t *)0x00004827))
#define EPMW9_HRPCTL_R              (*((volatile uint32_t *)0x0000482D))
#define EPMW9_TRREM_R               (*((volatile uint32_t *)0x0000482E))
#define EPMW9_GLDCTL_R              (*((volatile uint32_t *)0x00004834))
#define EPMW9_GLDCFG_R              (*((volatile uint32_t *)0x00004835))
#define EPMW9_EPWMXLINK_R           (*((volatile uint32_t *)0x00004838))
#define EPMW9_AQCTLA_R              (*((volatile uint32_t *)0x00004840))
#define EPMW9_AQCTLA2_R             (*((volatile uint32_t *)0x00004841))
#define EPMW9_AQCTLB_R              (*((volatile uint32_t *)0x00004842))
#define EPMW9_AQCTLB2_R             (*((volatile uint32_t *)0x00004843))
#define EPMW9_AQSFRC_R              (*((volatile uint32_t *)0x00004847))
#define EPMW9_AQCSFRC_R             (*((volatile uint32_t *)0x00004849))
#define EPMW9_DBREDHR_R             (*((volatile uint32_t *)0x00004850))
#define EPMW9_DBRED_R               (*((volatile uint32_t *)0x00004851))
#define EPMW9_DBFEDHR_R             (*((volatile uint32_t *)0x00004852))
#define EPMW9_DBFED_R               (*((volatile uint32_t *)0x00004853))
#define EPMW9_TBPHS_R               (*((volatile uint32_t *)0x00004860))
#define EPMW9_TBPRDHR_R             (*((volatile uint32_t *)0x00004862))
#define EPMW9_TBPRD_R               (*((volatile uint32_t *)0x00004863))
#define EPMW9_CMPA_R                (*((volatile uint32_t *)0x0000486A))
#define EPMW9_CMPB_R                (*((volatile uint32_t *)0x0000486C))
#define EPMW9_CMPC_R                (*((volatile uint32_t *)0x0000486F))
#define EPMW9_CMPD_R                (*((volatile uint32_t *)0x00004871))
#define EPMW9_GLDCTL2_R             (*((volatile uint32_t *)0x00004874))
#define EPMW9_SWVDELVAL_R           (*((volatile uint32_t *)0x00004877))
#define EPMW9_TZSEL_R               (*((volatile uint32_t *)0x00004880))
#define EPMW9_TZDCSEL_R             (*((volatile uint32_t *)0x00004882))
#define EPMW9_TZCTL_R               (*((volatile uint32_t *)0x00004884))
#define EPMW9_TZCTL2_R              (*((volatile uint32_t *)0x00004885))
#define EPMW9_TZCTLDCA_R            (*((volatile uint32_t *)0x00004886))
#define EPMW9_TZCTLDCB_R            (*((volatile uint32_t *)0x00004887))
#define EPMW9_TZEINT_R              (*((volatile uint32_t *)0x0000488D))
#define EPMW9_TZFLG_R               (*((volatile uint32_t *)0x00004893))
#define EPMW9_TZCBCFLG_R            (*((volatile uint32_t *)0x00004894))
#define EPMW9_TZOSTFLG_R            (*((volatile uint32_t *)0x00004895))
#define EPMW9_TZCLR_R               (*((volatile uint32_t *)0x00004897))
#define EPMW9_TZCBCCLR_R            (*((volatile uint32_t *)0x00004898))
#define EPMW9_TZOSTCLR_R            (*((volatile uint32_t *)0x00004899))
#define EPMW9_TZFRC_R               (*((volatile uint32_t *)0x0000489B))
#define EPMW9_ETSEL_R               (*((volatile uint32_t *)0x000048A4))
#define EPMW9_ETPS_R                (*((volatile uint32_t *)0x000048A6))
#define EPMW9_ETFLG_R               (*((volatile uint32_t *)0x000048A8))
#define EPMW9_ETCLR_R               (*((volatile uint32_t *)0x000048AA))
#define EPMW9_ETFRC_R               (*((volatile uint32_t *)0x000048AC))
#define EPMW9_ETINTPS_R             (*((volatile uint32_t *)0x000048AE))
#define EPMW9_ETSOCPS_R             (*((volatile uint32_t *)0x000048B0))
#define EPMW9_ETCNTINITCTL_R        (*((volatile uint32_t *)0x000048B2))
#define EPMW9_ETCNTINT_R            (*((volatile uint32_t *)0x000048B4))
#define EPMW9_DCTRIPSEL_R           (*((volatile uint32_t *)0x000048C0))
#define EPMW9_DCACTL_R              (*((volatile uint32_t *)0x000048C3))
#define EPMW9_DCBCTL_R              (*((volatile uint32_t *)0x000048C4))
#define EPMW9_DCFCTL_R              (*((volatile uint32_t *)0x000048C7))
#define EPMW9_DCCAPCTL_R            (*((volatile uint32_t *)0x000048C8))
#define EPMW9_DCFOFFSET_R           (*((volatile uint32_t *)0x000048C9))
#define EPMW9_DCFOFFSETCNT_R        (*((volatile uint32_t *)0x000048CA))
#define EPMW9_DCFWINDOW_R           (*((volatile uint32_t *)0x000048CB))
#define EPMW9_DCFWINDOWCNT_R        (*((volatile uint32_t *)0x000048CC))
#define EPMW9_DCCAP_R               (*((volatile uint32_t *)0x000048CF))
#define EPMW9_DCAHTRIPSEL_R         (*((volatile uint32_t *)0x000048D2))
#define EPMW9_DCALTRIPSEL_R         (*((volatile uint32_t *)0x000048D3))
#define EPMW9_DCBHTRIPSEL_R         (*((volatile uint32_t *)0x000048D4))
#define EPMW9_DCBLTRIPSEL_R         (*((volatile uint32_t *)0x000048D5))
#define EPMW9_HWVDELVAL_R           (*((volatile uint32_t *)0x000048FD))
#define EPMW9_VCNTVAL_R             (*((volatile uint32_t *)0x000048FE))

