Daniel9719/Emotion_Detector_UNAM/CCS/Sensor_Testing_Files/tms320f28379d.h
//*****************************************************************************
//
// ePWM Register 10 (EPWM_REGS 10)
//
//*****************************************************************************
#define EPMW10_TBCTL_R               (*((volatile uint32_t *)0x00004900))
#define EPMW10_TBCTL2_R              (*((volatile uint32_t *)0x00004901))
#define EPMW10_TBCTR_R               (*((volatile uint32_t *)0x00004904))
#define EPMW10_TBSTS_R               (*((volatile uint32_t *)0x00004905))
#define EPMW10_CMPCTL_R              (*((volatile uint32_t *)0x00004908))
#define EPMW10_CMPCTL2_R             (*((volatile uint32_t *)0x00004909))
#define EPMW10_DBCTL_R               (*((volatile uint32_t *)0x0000490C))
#define EPMW10_DBCTL2_R              (*((volatile uint32_t *)0x0000490D))
#define EPMW10_AQCTL_R               (*((volatile uint32_t *)0x00004910))
#define EPMW10_AQTSRCSEL_R           (*((volatile uint32_t *)0x00004911))
#define EPMW10_PCCTL_R               (*((volatile uint32_t *)0x00004914))
#define EPMW10_VCAPCTL_R             (*((volatile uint32_t *)0x00004918))
#define EPMW10_VCNTCFG_R             (*((volatile uint32_t *)0x00004919))
#define EPMW10_HRCNFG_R              (*((volatile uint32_t *)0x00004920))
#define EPMW10_HRPWR_R               (*((volatile uint32_t *)0x00004921))
#define EPMW10_HRMSTEP_R             (*((volatile uint32_t *)0x00004926))
#define EPMW10_HRCNFG2_R             (*((volatile uint32_t *)0x00004927))
#define EPMW10_HRPCTL_R              (*((volatile uint32_t *)0x0000492D))
#define EPMW10_TRREM_R               (*((volatile uint32_t *)0x0000492E))
#define EPMW10_GLDCTL_R              (*((volatile uint32_t *)0x00004934))
#define EPMW10_GLDCFG_R              (*((volatile uint32_t *)0x00004935))
#define EPMW10_EPWMXLINK_R           (*((volatile uint32_t *)0x00004938))
#define EPMW10_AQCTLA_R              (*((volatile uint32_t *)0x00004940))
#define EPMW10_AQCTLA2_R             (*((volatile uint32_t *)0x00004941))
#define EPMW10_AQCTLB_R              (*((volatile uint32_t *)0x00004942))
#define EPMW10_AQCTLB2_R             (*((volatile uint32_t *)0x00004943))
#define EPMW10_AQSFRC_R              (*((volatile uint32_t *)0x00004947))
#define EPMW10_AQCSFRC_R             (*((volatile uint32_t *)0x00004949))
#define EPMW10_DBREDHR_R             (*((volatile uint32_t *)0x00004950))
#define EPMW10_DBRED_R               (*((volatile uint32_t *)0x00004951))
#define EPMW10_DBFEDHR_R             (*((volatile uint32_t *)0x00004952))
#define EPMW10_DBFED_R               (*((volatile uint32_t *)0x00004953))
#define EPMW10_TBPHS_R               (*((volatile uint32_t *)0x00004960))
#define EPMW10_TBPRDHR_R             (*((volatile uint32_t *)0x00004962))
#define EPMW10_TBPRD_R               (*((volatile uint32_t *)0x00004963))
#define EPMW10_CMPA_R                (*((volatile uint32_t *)0x0000496A))
#define EPMW10_CMPB_R                (*((volatile uint32_t *)0x0000496C))
#define EPMW10_CMPC_R                (*((volatile uint32_t *)0x0000496F))
#define EPMW10_CMPD_R                (*((volatile uint32_t *)0x00004971))
#define EPMW10_GLDCTL2_R             (*((volatile uint32_t *)0x00004974))
#define EPMW10_SWVDELVAL_R           (*((volatile uint32_t *)0x00004977))
#define EPMW10_TZSEL_R               (*((volatile uint32_t *)0x00004980))
#define EPMW10_TZDCSEL_R             (*((volatile uint32_t *)0x00004982))
#define EPMW10_TZCTL_R               (*((volatile uint32_t *)0x00004984))
#define EPMW10_TZCTL2_R              (*((volatile uint32_t *)0x00004985))
#define EPMW10_TZCTLDCA_R            (*((volatile uint32_t *)0x00004986))
#define EPMW10_TZCTLDCB_R            (*((volatile uint32_t *)0x00004987))
#define EPMW10_TZEINT_R              (*((volatile uint32_t *)0x0000498D))
#define EPMW10_TZFLG_R               (*((volatile uint32_t *)0x00004993))
#define EPMW10_TZCBCFLG_R            (*((volatile uint32_t *)0x00004994))
#define EPMW10_TZOSTFLG_R            (*((volatile uint32_t *)0x00004995))
#define EPMW10_TZCLR_R               (*((volatile uint32_t *)0x00004997))
#define EPMW10_TZCBCCLR_R            (*((volatile uint32_t *)0x00004998))
#define EPMW10_TZOSTCLR_R            (*((volatile uint32_t *)0x00004999))
#define EPMW10_TZFRC_R               (*((volatile uint32_t *)0x0000499B))
#define EPMW10_ETSEL_R               (*((volatile uint32_t *)0x000049A4))
#define EPMW10_ETPS_R                (*((volatile uint32_t *)0x000049A6))
#define EPMW10_ETFLG_R               (*((volatile uint32_t *)0x000049A8))
#define EPMW10_ETCLR_R               (*((volatile uint32_t *)0x000049AA))
#define EPMW10_ETFRC_R               (*((volatile uint32_t *)0x000049AC))
#define EPMW10_ETINTPS_R             (*((volatile uint32_t *)0x000049AE))
#define EPMW10_ETSOCPS_R             (*((volatile uint32_t *)0x000049B0))
#define EPMW10_ETCNTINITCTL_R        (*((volatile uint32_t *)0x000049B2))
#define EPMW10_ETCNTINT_R            (*((volatile uint32_t *)0x000049B4))
#define EPMW10_DCTRIPSEL_R           (*((volatile uint32_t *)0x000049C0))
#define EPMW10_DCACTL_R              (*((volatile uint32_t *)0x000049C3))
#define EPMW10_DCBCTL_R              (*((volatile uint32_t *)0x000049C4))
#define EPMW10_DCFCTL_R              (*((volatile uint32_t *)0x000049C7))
#define EPMW10_DCCAPCTL_R            (*((volatile uint32_t *)0x000049C8))
#define EPMW10_DCFOFFSET_R           (*((volatile uint32_t *)0x000049C9))
#define EPMW10_DCFOFFSETCNT_R        (*((volatile uint32_t *)0x000049CA))
#define EPMW10_DCFWINDOW_R           (*((volatile uint32_t *)0x000049CB))
#define EPMW10_DCFWINDOWCNT_R        (*((volatile uint32_t *)0x000049CC))
#define EPMW10_DCCAP_R               (*((volatile uint32_t *)0x000049CF))
#define EPMW10_DCAHTRIPSEL_R         (*((volatile uint32_t *)0x000049D2))
#define EPMW10_DCALTRIPSEL_R         (*((volatile uint32_t *)0x000049D3))
#define EPMW10_DCBHTRIPSEL_R         (*((volatile uint32_t *)0x000049D4))
#define EPMW10_DCBLTRIPSEL_R         (*((volatile uint32_t *)0x000049D5))
#define EPMW10_HWVDELVAL_R           (*((volatile uint32_t *)0x000049FD))
#define EPMW10_VCNTVAL_R             (*((volatile uint32_t *)0x000049FE))

//*****************************************************************************
//
// ePWM Register 11 (EPWM_REGS 11)
//
//*****************************************************************************
#define EPMW11_TBCTL_R               (*((volatile uint32_t *)0x00004A00))
#define EPMW11_TBCTL2_R              (*((volatile uint32_t *)0x00004A01))
#define EPMW11_TBCTR_R               (*((volatile uint32_t *)0x00004A04))
#define EPMW11_TBSTS_R               (*((volatile uint32_t *)0x00004A05))
#define EPMW11_CMPCTL_R              (*((volatile uint32_t *)0x00004A08))
#define EPMW11_CMPCTL2_R             (*((volatile uint32_t *)0x00004A09))
#define EPMW11_DBCTL_R               (*((volatile uint32_t *)0x00004A0C))
#define EPMW11_DBCTL2_R              (*((volatile uint32_t *)0x00004A0D))
#define EPMW11_AQCTL_R               (*((volatile uint32_t *)0x00004A10))
#define EPMW11_AQTSRCSEL_R           (*((volatile uint32_t *)0x00004A11))
#define EPMW11_PCCTL_R               (*((volatile uint32_t *)0x00004A14))
#define EPMW11_VCAPCTL_R             (*((volatile uint32_t *)0x00004A18))
#define EPMW11_VCNTCFG_R             (*((volatile uint32_t *)0x00004A19))
#define EPMW11_HRCNFG_R              (*((volatile uint32_t *)0x00004A20))
#define EPMW11_HRPWR_R               (*((volatile uint32_t *)0x00004A21))
#define EPMW11_HRMSTEP_R             (*((volatile uint32_t *)0x00004A26))
#define EPMW11_HRCNFG2_R             (*((volatile uint32_t *)0x00004A27))
#define EPMW11_HRPCTL_R              (*((volatile uint32_t *)0x00004A2D))
#define EPMW11_TRREM_R               (*((volatile uint32_t *)0x00004A2E))
#define EPMW11_GLDCTL_R              (*((volatile uint32_t *)0x00004A34))
#define EPMW11_GLDCFG_R              (*((volatile uint32_t *)0x00004A35))
#define EPMW11_EPWMXLINK_R           (*((volatile uint32_t *)0x00004A38))
#define EPMW11_AQCTLA_R              (*((volatile uint32_t *)0x00004A40))
#define EPMW11_AQCTLA2_R             (*((volatile uint32_t *)0x00004A41))
#define EPMW11_AQCTLB_R              (*((volatile uint32_t *)0x00004A42))
#define EPMW11_AQCTLB2_R             (*((volatile uint32_t *)0x00004A43))
#define EPMW11_AQSFRC_R              (*((volatile uint32_t *)0x00004A47))
#define EPMW11_AQCSFRC_R             (*((volatile uint32_t *)0x00004A49))
#define EPMW11_DBREDHR_R             (*((volatile uint32_t *)0x00004A50))
#define EPMW11_DBRED_R               (*((volatile uint32_t *)0x00004A51))
#define EPMW11_DBFEDHR_R             (*((volatile uint32_t *)0x00004A52))
#define EPMW11_DBFED_R               (*((volatile uint32_t *)0x00004A53))
#define EPMW11_TBPHS_R               (*((volatile uint32_t *)0x00004A60))
#define EPMW11_TBPRDHR_R             (*((volatile uint32_t *)0x00004A62))
#define EPMW11_TBPRD_R               (*((volatile uint32_t *)0x00004A63))
#define EPMW11_CMPA_R                (*((volatile uint32_t *)0x00004A6A))
#define EPMW11_CMPB_R                (*((volatile uint32_t *)0x00004A6C))
#define EPMW11_CMPC_R                (*((volatile uint32_t *)0x00004A6F))
#define EPMW11_CMPD_R                (*((volatile uint32_t *)0x00004A71))
#define EPMW11_GLDCTL2_R             (*((volatile uint32_t *)0x00004A74))
#define EPMW11_SWVDELVAL_R           (*((volatile uint32_t *)0x00004A77))
#define EPMW11_TZSEL_R               (*((volatile uint32_t *)0x00004A80))
#define EPMW11_TZDCSEL_R             (*((volatile uint32_t *)0x00004A82))
#define EPMW11_TZCTL_R               (*((volatile uint32_t *)0x00004A84))
#define EPMW11_TZCTL2_R              (*((volatile uint32_t *)0x00004A85))
#define EPMW11_TZCTLDCA_R            (*((volatile uint32_t *)0x00004A86))
#define EPMW11_TZCTLDCB_R            (*((volatile uint32_t *)0x00004A87))
#define EPMW11_TZEINT_R              (*((volatile uint32_t *)0x00004A8D))
#define EPMW11_TZFLG_R               (*((volatile uint32_t *)0x00004A93))
#define EPMW11_TZCBCFLG_R            (*((volatile uint32_t *)0x00004A94))
#define EPMW11_TZOSTFLG_R            (*((volatile uint32_t *)0x00004A95))
#define EPMW11_TZCLR_R               (*((volatile uint32_t *)0x00004A97))
#define EPMW11_TZCBCCLR_R            (*((volatile uint32_t *)0x00004A98))
#define EPMW11_TZOSTCLR_R            (*((volatile uint32_t *)0x00004A99))
#define EPMW11_TZFRC_R               (*((volatile uint32_t *)0x00004A9B))
#define EPMW11_ETSEL_R               (*((volatile uint32_t *)0x00004AA4))
#define EPMW11_ETPS_R                (*((volatile uint32_t *)0x00004AA6))
#define EPMW11_ETFLG_R               (*((volatile uint32_t *)0x00004AA8))
#define EPMW11_ETCLR_R               (*((volatile uint32_t *)0x00004AAA))
#define EPMW11_ETFRC_R               (*((volatile uint32_t *)0x00004AAC))
#define EPMW11_ETINTPS_R             (*((volatile uint32_t *)0x00004AAE))
#define EPMW11_ETSOCPS_R             (*((volatile uint32_t *)0x00004AB0))
#define EPMW11_ETCNTINITCTL_R        (*((volatile uint32_t *)0x00004AB2))
#define EPMW11_ETCNTINT_R            (*((volatile uint32_t *)0x00004AB4))
#define EPMW11_DCTRIPSEL_R           (*((volatile uint32_t *)0x00004AC0))
#define EPMW11_DCACTL_R              (*((volatile uint32_t *)0x00004AC3))
#define EPMW11_DCBCTL_R              (*((volatile uint32_t *)0x00004AC4))
#define EPMW11_DCFCTL_R              (*((volatile uint32_t *)0x00004AC7))
#define EPMW11_DCCAPCTL_R            (*((volatile uint32_t *)0x00004AC8))
#define EPMW11_DCFOFFSET_R           (*((volatile uint32_t *)0x00004AC9))
#define EPMW11_DCFOFFSETCNT_R        (*((volatile uint32_t *)0x00004ACA))
#define EPMW11_DCFWINDOW_R           (*((volatile uint32_t *)0x00004ACB))
#define EPMW11_DCFWINDOWCNT_R        (*((volatile uint32_t *)0x00004ACC))
#define EPMW11_DCCAP_R               (*((volatile uint32_t *)0x00004ACF))
#define EPMW11_DCAHTRIPSEL_R         (*((volatile uint32_t *)0x00004AD2))
#define EPMW11_DCALTRIPSEL_R         (*((volatile uint32_t *)0x00004AD3))
#define EPMW11_DCBHTRIPSEL_R         (*((volatile uint32_t *)0x00004AD4))
#define EPMW11_DCBLTRIPSEL_R         (*((volatile uint32_t *)0x00004AD5))
#define EPMW11_HWVDELVAL_R           (*((volatile uint32_t *)0x00004AFD))
#define EPMW11_VCNTVAL_R             (*((volatile uint32_t *)0x00004AFE))

//*****************************************************************************
//
// ePWM Register 12 (EPWM_REGS 12)
//
//*****************************************************************************
#define EPMW12_TBCTL_R               (*((volatile uint32_t *)0x00004B00))
#define EPMW12_TBCTL2_R              (*((volatile uint32_t *)0x00004B01))
#define EPMW12_TBCTR_R               (*((volatile uint32_t *)0x00004B04))
#define EPMW12_TBSTS_R               (*((volatile uint32_t *)0x00004B05))
#define EPMW12_CMPCTL_R              (*((volatile uint32_t *)0x00004B08))
#define EPMW12_CMPCTL2_R             (*((volatile uint32_t *)0x00004B09))
#define EPMW12_DBCTL_R               (*((volatile uint32_t *)0x00004B0C))
#define EPMW12_DBCTL2_R              (*((volatile uint32_t *)0x00004B0D))
#define EPMW12_AQCTL_R               (*((volatile uint32_t *)0x00004B10))
#define EPMW12_AQTSRCSEL_R           (*((volatile uint32_t *)0x00004B11))
#define EPMW12_PCCTL_R               (*((volatile uint32_t *)0x00004B14))
#define EPMW12_VCAPCTL_R             (*((volatile uint32_t *)0x00004B18))
#define EPMW12_VCNTCFG_R             (*((volatile uint32_t *)0x00004B19))
#define EPMW12_HRCNFG_R              (*((volatile uint32_t *)0x00004B20))
#define EPMW12_HRPWR_R               (*((volatile uint32_t *)0x00004B21))
#define EPMW12_HRMSTEP_R             (*((volatile uint32_t *)0x00004B26))
#define EPMW12_HRCNFG2_R             (*((volatile uint32_t *)0x00004B27))
#define EPMW12_HRPCTL_R              (*((volatile uint32_t *)0x00004B2D))
#define EPMW12_TRREM_R               (*((volatile uint32_t *)0x00004B2E))
#define EPMW12_GLDCTL_R              (*((volatile uint32_t *)0x00004B34))
#define EPMW12_GLDCFG_R              (*((volatile uint32_t *)0x00004B35))
#define EPMW12_EPWMXLINK_R           (*((volatile uint32_t *)0x00004B38))
#define EPMW12_AQCTLA_R              (*((volatile uint32_t *)0x00004B40))
#define EPMW12_AQCTLA2_R             (*((volatile uint32_t *)0x00004B41))
#define EPMW12_AQCTLB_R              (*((volatile uint32_t *)0x00004B42))
#define EPMW12_AQCTLB2_R             (*((volatile uint32_t *)0x00004B43))
#define EPMW12_AQSFRC_R              (*((volatile uint32_t *)0x00004B47))
#define EPMW12_AQCSFRC_R             (*((volatile uint32_t *)0x00004B49))
#define EPMW12_DBREDHR_R             (*((volatile uint32_t *)0x00004B50))
#define EPMW12_DBRED_R               (*((volatile uint32_t *)0x00004B51))
#define EPMW12_DBFEDHR_R             (*((volatile uint32_t *)0x00004B52))
#define EPMW12_DBFED_R               (*((volatile uint32_t *)0x00004B53))
#define EPMW12_TBPHS_R               (*((volatile uint32_t *)0x00004B60))
#define EPMW12_TBPRDHR_R             (*((volatile uint32_t *)0x00004B62))
#define EPMW12_TBPRD_R               (*((volatile uint32_t *)0x00004B63))
#define EPMW12_CMPA_R                (*((volatile uint32_t *)0x00004B6A))
#define EPMW12_CMPB_R                (*((volatile uint32_t *)0x00004B6C))
#define EPMW12_CMPC_R                (*((volatile uint32_t *)0x00004B6F))
#define EPMW12_CMPD_R                (*((volatile uint32_t *)0x00004B71))
#define EPMW12_GLDCTL2_R             (*((volatile uint32_t *)0x00004B74))
#define EPMW12_SWVDELVAL_R           (*((volatile uint32_t *)0x00004B77))
#define EPMW12_TZSEL_R               (*((volatile uint32_t *)0x00004B80))
#define EPMW12_TZDCSEL_R             (*((volatile uint32_t *)0x00004B82))
#define EPMW12_TZCTL_R               (*((volatile uint32_t *)0x00004B84))
#define EPMW12_TZCTL2_R              (*((volatile uint32_t *)0x00004B85))
#define EPMW12_TZCTLDCA_R            (*((volatile uint32_t *)0x00004B86))
#define EPMW12_TZCTLDCB_R            (*((volatile uint32_t *)0x00004B87))
#define EPMW12_TZEINT_R              (*((volatile uint32_t *)0x00004B8D))
#define EPMW12_TZFLG_R               (*((volatile uint32_t *)0x00004B93))
#define EPMW12_TZCBCFLG_R            (*((volatile uint32_t *)0x00004B94))
#define EPMW12_TZOSTFLG_R            (*((volatile uint32_t *)0x00004B95))
#define EPMW12_TZCLR_R               (*((volatile uint32_t *)0x00004B97))
#define EPMW12_TZCBCCLR_R            (*((volatile uint32_t *)0x00004B98))
#define EPMW12_TZOSTCLR_R            (*((volatile uint32_t *)0x00004B99))
#define EPMW12_TZFRC_R               (*((volatile uint32_t *)0x00004B9B))
#define EPMW12_ETSEL_R               (*((volatile uint32_t *)0x00004BA4))
#define EPMW12_ETPS_R                (*((volatile uint32_t *)0x00004BA6))
#define EPMW12_ETFLG_R               (*((volatile uint32_t *)0x00004BA8))
#define EPMW12_ETCLR_R               (*((volatile uint32_t *)0x00004BAA))
#define EPMW12_ETFRC_R               (*((volatile uint32_t *)0x00004BAC))
#define EPMW12_ETINTPS_R             (*((volatile uint32_t *)0x00004BAE))
#define EPMW12_ETSOCPS_R             (*((volatile uint32_t *)0x00004BB0))
#define EPMW12_ETCNTINITCTL_R        (*((volatile uint32_t *)0x00004BB2))
#define EPMW12_ETCNTINT_R            (*((volatile uint32_t *)0x00004BB4))
#define EPMW12_DCTRIPSEL_R           (*((volatile uint32_t *)0x00004BC0))
#define EPMW12_DCACTL_R              (*((volatile uint32_t *)0x00004BC3))
#define EPMW12_DCBCTL_R              (*((volatile uint32_t *)0x00004BC4))
#define EPMW12_DCFCTL_R              (*((volatile uint32_t *)0x00004BC7))
#define EPMW12_DCCAPCTL_R            (*((volatile uint32_t *)0x00004BC8))
#define EPMW12_DCFOFFSET_R           (*((volatile uint32_t *)0x00004BC9))
#define EPMW12_DCFOFFSETCNT_R        (*((volatile uint32_t *)0x00004BCA))
#define EPMW12_DCFWINDOW_R           (*((volatile uint32_t *)0x00004BCB))
#define EPMW12_DCFWINDOWCNT_R        (*((volatile uint32_t *)0x00004BCC))
#define EPMW12_DCCAP_R               (*((volatile uint32_t *)0x00004BCF))
#define EPMW12_DCAHTRIPSEL_R         (*((volatile uint32_t *)0x00004BD2))
#define EPMW12_DCALTRIPSEL_R         (*((volatile uint32_t *)0x00004BD3))
#define EPMW12_DCBHTRIPSEL_R         (*((volatile uint32_t *)0x00004BD4))
#define EPMW12_DCBLTRIPSEL_R         (*((volatile uint32_t *)0x00004BD5))
#define EPMW12_HWVDELVAL_R           (*((volatile uint32_t *)0x00004BFD))
#define EPMW12_VCNTVAL_R             (*((volatile uint32_t *)0x00004BFE))

//*****************************************************************************
//
// SPI registers (SPIA)
//
//*****************************************************************************
#define SPIA_CCR_R                  (*((volatile uint32_t *)0x00006100))
#define SPIA_CTL_R                  (*((volatile uint32_t *)0x00006101))
#define SPIA_STS_R                  (*((volatile uint32_t *)0x00006102))
#define SPIA_BRR_R                  (*((volatile uint32_t *)0x00006104))
#define SPIA_RXEMU_R                (*((volatile uint32_t *)0x00006106))
#define SPIA_RXBUF_R                (*((volatile uint32_t *)0x00006108))
#define SPIA_DAT_R                  (*((volatile uint32_t *)0x00006109))
#define SPIA_FFTX_R                 (*((volatile uint32_t *)0x0000610A))
#define SPIA_FFRX_R                 (*((volatile uint32_t *)0x0000610B))
#define SPIA_FFCTL_R                (*((volatile uint32_t *)0x0000610C))
#define SPIA_PRI_R                  (*((volatile uint32_t *)0x0000610F))

//*****************************************************************************
//
// SPI registers (SPIB)
//
//*****************************************************************************
#define SPIB_CCR_R                  (*((volatile uint32_t *)0x00006110))
#define SPIB_CTL_R                  (*((volatile uint32_t *)0x00006111))
#define SPIB_STS_R                  (*((volatile uint32_t *)0x00006112))
#define SPIB_BRR_R                  (*((volatile uint32_t *)0x00006114))
#define SPIB_RXEMU_R                (*((volatile uint32_t *)0x00006116))
#define SPIB_RXBUF_R                (*((volatile uint32_t *)0x00006118))
#define SPIB_DAT_R                  (*((volatile uint32_t *)0x00006119))
#define SPIB_FFTX_R                 (*((volatile uint32_t *)0x0000611A))
#define SPIB_FFRX_R                 (*((volatile uint32_t *)0x0000611B))
#define SPIB_FFCTL_R                (*((volatile uint32_t *)0x0000611C))
#define SPIB_PRI_R                  (*((volatile uint32_t *)0x0000611F))

//*****************************************************************************
//
// SPI registers (SPIC)
//
//*****************************************************************************
#define SPIC_CCR_R                  (*((volatile uint32_t *)0x00006120))
#define SPIC_CTL_R                  (*((volatile uint32_t *)0x00006121))
#define SPIC_STS_R                  (*((volatile uint32_t *)0x00006122))
#define SPIC_BRR_R                  (*((volatile uint32_t *)0x00006124))
#define SPIC_RXEMU_R                (*((volatile uint32_t *)0x00006126))
#define SPIC_RXBUF_R                (*((volatile uint32_t *)0x00006128))
#define SPIC_DAT_R                  (*((volatile uint32_t *)0x00006129))
#define SPIC_FFTX_R                 (*((volatile uint32_t *)0x0000612A))
#define SPIC_FFRX_R                 (*((volatile uint32_t *)0x0000612B))
#define SPIC_FFCTL_R                (*((volatile uint32_t *)0x0000612C))
#define SPIC_PRI_R                  (*((volatile uint32_t *)0x0000612F))

//*****************************************************************************
//
// XINT registers (XINT_REGS)
//
//*****************************************************************************
#define XINT1CR_R                   (*((volatile uint32_t *)0x00007070))
#define XINT2CR_R                   (*((volatile uint32_t *)0x00007071))
#define XINT3CR_R                   (*((volatile uint32_t *)0x00007072))
#define XINT4CR_R                   (*((volatile uint32_t *)0x00007073))
#define XINT5CR_R                   (*((volatile uint32_t *)0x00007074))
#define XINT1CTR_R                  (*((volatile uint32_t *)0x00007078))
#define XINT2CTR_R                  (*((volatile uint32_t *)0x00007079))
#define XINT3CTR_R                  (*((volatile uint32_t *)0x0000707A))

//*****************************************************************************
//
// Serial Communications Interface registers (SCIA)
//
//*****************************************************************************
#define SCIA_CCR_R                  (*((volatile uint32_t *)0x00007200))
#define SCIA_CTL1_R                 (*((volatile uint32_t *)0x00007201))
#define SCIA_HBAUD_R                (*((volatile uint32_t *)0x00007202))
#define SCIA_LBAUD_R                (*((volatile uint32_t *)0x00007203))
#define SCIA_CTL2_R                 (*((volatile uint32_t *)0x00007204))
#define SCIA_RXST_R                 (*((volatile uint32_t *)0x00007205))
#define SCIA_RXEMU_R                (*((volatile uint32_t *)0x00007206))
#define SCIA_RXBUF_R                (*((volatile uint32_t *)0x00007207))
#define SCIA_TXBUF_R                (*((volatile uint32_t *)0x00007209))
#define SCIA_FFTX_R                 (*((volatile uint32_t *)0x0000720A))
#define SCIA_FFRX_R                 (*((volatile uint32_t *)0x0000720B))
#define SCIA_FFCT_R                 (*((volatile uint32_t *)0x0000720C))
#define SCIA_PRI_R                  (*((volatile uint32_t *)0x0000720F))

