Daniel9719/Emotion_Detector_UNAM/CCS/Sensor_Testing_Files/tms320f28379d.h
//*****************************************************************************
//
// Serial Communications Interface registers (SCIB)
//
//*****************************************************************************
#define SCIB_CCR_R                  (*((volatile uint32_t *)0x00007210))
#define SCIB_CTL1_R                 (*((volatile uint32_t *)0x00007211))
#define SCIB_HBAUD_R                (*((volatile uint32_t *)0x00007212))
#define SCIB_LBAUD_R                (*((volatile uint32_t *)0x00007213))
#define SCIB_CTL2_R                 (*((volatile uint32_t *)0x00007214))
#define SCIB_RXST_R                 (*((volatile uint32_t *)0x00007215))
#define SCIB_RXEMU_R                (*((volatile uint32_t *)0x00007216))
#define SCIB_RXBUF_R                (*((volatile uint32_t *)0x00007217))
#define SCIB_TXBUF_R                (*((volatile uint32_t *)0x00007219))
#define SCIB_FFTX_R                 (*((volatile uint32_t *)0x0000721A))
#define SCIB_FFRX_R                 (*((volatile uint32_t *)0x0000721B))
#define SCIB_FFCT_R                 (*((volatile uint32_t *)0x0000721C))
#define SCIB_PRI_R                  (*((volatile uint32_t *)0x0000721F))

//*****************************************************************************
//
// Serial Communications Interface registers (SCIC)
//
//*****************************************************************************
#define SCIC_CCR_R                  (*((volatile uint32_t *)0x00007220))
#define SCIC_CTL1_R                 (*((volatile uint32_t *)0x00007221))
#define SCIC_HBAUD_R                (*((volatile uint32_t *)0x00007222))
#define SCIC_LBAUD_R                (*((volatile uint32_t *)0x00007223))
#define SCIC_CTL2_R                 (*((volatile uint32_t *)0x00007224))
#define SCIC_RXST_R                 (*((volatile uint32_t *)0x00007225))
#define SCIC_RXEMU_R                (*((volatile uint32_t *)0x00007226))
#define SCIC_RXBUF_R                (*((volatile uint32_t *)0x00007227))
#define SCIC_TXBUF_R                (*((volatile uint32_t *)0x00007229))
#define SCIC_FFTX_R                 (*((volatile uint32_t *)0x0000722A))
#define SCIC_FFRX_R                 (*((volatile uint32_t *)0x0000722B))
#define SCIC_FFCT_R                 (*((volatile uint32_t *)0x0000722C))
#define SCIC_PRI_R                  (*((volatile uint32_t *)0x0000722F))

//*****************************************************************************
//
// Serial Communications Interface registers (SCID)
//
//*****************************************************************************
#define SCID_CCR_R                  (*((volatile uint32_t *)0x00007230))
#define SCID_CTL1_R                 (*((volatile uint32_t *)0x00007231))
#define SCID_HBAUD_R                (*((volatile uint32_t *)0x00007232))
#define SCID_LBAUD_R                (*((volatile uint32_t *)0x00007233))
#define SCID_CTL2_R                 (*((volatile uint32_t *)0x00007234))
#define SCID_RXST_R                 (*((volatile uint32_t *)0x00007235))
#define SCID_RXEMU_R                (*((volatile uint32_t *)0x00007236))
#define SCID_RXBUF_R                (*((volatile uint32_t *)0x00007237))
#define SCID_TXBUF_R                (*((volatile uint32_t *)0x00007239))
#define SCID_FFTX_R                 (*((volatile uint32_t *)0x0000723A))
#define SCID_FFRX_R                 (*((volatile uint32_t *)0x0000723B))
#define SCID_FFCT_R                 (*((volatile uint32_t *)0x0000723C))
#define SCID_PRI_R                  (*((volatile uint32_t *)0x0000723F))

//*****************************************************************************
//
// I2C registers (I2CA)
//
//*****************************************************************************
#define I2CA_OAR_R                  (*((volatile uint32_t *)0x00007300))
#define I2CA_IER_R                  (*((volatile uint32_t *)0x00007301))
#define I2CA_STR_R                  (*((volatile uint32_t *)0x00007302))
#define I2CA_CLKL_R                 (*((volatile uint32_t *)0x00007303))
#define I2CA_CLKH_R                 (*((volatile uint32_t *)0x00007304))
#define I2CA_CNT_R                  (*((volatile uint32_t *)0x00007305))
#define I2CA_DRR_R                  (*((volatile uint32_t *)0x00007306))
#define I2CA_SAR_R                  (*((volatile uint32_t *)0x00007307))
#define I2CA_DXR_R                  (*((volatile uint32_t *)0x00007308))
#define I2CA_MDR_R                  (*((volatile uint32_t *)0x00007309))
#define I2CA_ISRC_R                 (*((volatile uint32_t *)0x0000730A))
#define I2CA_EMDR_R                 (*((volatile uint32_t *)0x0000730B))
#define I2CA_PSC_R                  (*((volatile uint32_t *)0x0000730C))
#define I2CA_FFTX_R                 (*((volatile uint32_t *)0x00007320))
#define I2CA_FFRX_R                 (*((volatile uint32_t *)0x00007321))

//*****************************************************************************
//
// I2C registers (I2CB)
//
//*****************************************************************************
#define I2CB_OAR_R                  (*((volatile uint32_t *)0x00007300))
#define I2CB_IER_R                  (*((volatile uint32_t *)0x00007341))
#define I2CB_STR_R                  (*((volatile uint32_t *)0x00007342))
#define I2CB_CLKL_R                 (*((volatile uint32_t *)0x00007343))
#define I2CB_CLKH_R                 (*((volatile uint32_t *)0x00007344))
#define I2CB_CNT_R                  (*((volatile uint32_t *)0x00007345))
#define I2CB_DRR_R                  (*((volatile uint32_t *)0x00007346))
#define I2CB_SAR_R                  (*((volatile uint32_t *)0x00007347))
#define I2CB_DXR_R                  (*((volatile uint32_t *)0x00007348))
#define I2CB_MDR_R                  (*((volatile uint32_t *)0x00007349))
#define I2CB_ISRC_R                 (*((volatile uint32_t *)0x0000734A))
#define I2CB_EMDR_R                 (*((volatile uint32_t *)0x0000734B))
#define I2CB_PSC_R                  (*((volatile uint32_t *)0x0000734C))
#define I2CB_FFTX_R                 (*((volatile uint32_t *)0x00007360))
#define I2CB_FFRX_R                 (*((volatile uint32_t *)0x00007361))

//*****************************************************************************
//
// Input XBAR Registers (INPUT_XBAR_REGS)
//
//*****************************************************************************
#define XBAR_IN_SEL1_R              (*((volatile uint32_t *)0x00007900))
#define XBAR_IN_SEL2_R              (*((volatile uint32_t *)0x00007901))
#define XBAR_IN_SEL3_R              (*((volatile uint32_t *)0x00007902))
#define XBAR_IN_SEL4_R              (*((volatile uint32_t *)0x00007903))
#define XBAR_IN_SEL5_R              (*((volatile uint32_t *)0x00007904))
#define XBAR_IN_SEL6_R              (*((volatile uint32_t *)0x00007905))
#define XBAR_IN_SEL7_R              (*((volatile uint32_t *)0x00007906))
#define XBAR_IN_SEL8_R              (*((volatile uint32_t *)0x00007907))
#define XBAR_IN_SEL9_R              (*((volatile uint32_t *)0x00007908))
#define XBAR_IN_SEL10_R             (*((volatile uint32_t *)0x00007909))
#define XBAR_IN_SEL11_R             (*((volatile uint32_t *)0x0000790A))
#define XBAR_IN_SEL12_R             (*((volatile uint32_t *)0x0000790B))
#define XBAR_IN_SEL13_R             (*((volatile uint32_t *)0x0000790C))
#define XBAR_IN_SEL14_R             (*((volatile uint32_t *)0x0000790D))
#define XBAR_IN_SELLOCK_R           (*((volatile uint32_t *)0x0000791E))

//*****************************************************************************
//
// XBAR Registers (XBAR_REGS)
//
//*****************************************************************************
#define XBAR_FLG1_R                 (*((volatile uint32_t *)0x00007920))
#define XBAR_FLG2_R                 (*((volatile uint32_t *)0x00007922))
#define XBAR_FLG3_R                 (*((volatile uint32_t *)0x00007924))
#define XBAR_CLR1_R                 (*((volatile uint32_t *)0x00007928))
#define XBAR_CLR2_R                 (*((volatile uint32_t *)0x0000792A))
#define XBAR_CLR3_R                 (*((volatile uint32_t *)0x0000792C))

//*****************************************************************************
//
// Output XBAR Registers (OUTPUT_XBAR_REGS)
//
//*****************************************************************************
#define XBAR_OUT_1MUX0TO15CFG_R     (*((volatile uint32_t *)0x00007A80))
#define XBAR_OUT_1MUX16TO31CFG_R    (*((volatile uint32_t *)0x00007A82))
#define XBAR_OUT_2MUX0TO15CFG_R     (*((volatile uint32_t *)0x00007A84))
#define XBAR_OUT_2MUX16TO31CFG_R    (*((volatile uint32_t *)0x00007A86))
#define XBAR_OUT_3MUX0TO15CFG_R     (*((volatile uint32_t *)0x00007A88))
#define XBAR_OUT_3MUX16TO31CFG_R    (*((volatile uint32_t *)0x00007A8A))
#define XBAR_OUT_4MUX0TO15CFG_R     (*((volatile uint32_t *)0x00007A8C))
#define XBAR_OUT_4MUX16TO31CFG_R    (*((volatile uint32_t *)0x00007A8E))
#define XBAR_OUT_5MUX0TO15CFG_R     (*((volatile uint32_t *)0x00007A90))
#define XBAR_OUT_5MUX16TO31CFG_R    (*((volatile uint32_t *)0x00007A92))
#define XBAR_OUT_6MUX0TO15CFG_R     (*((volatile uint32_t *)0x00007A94))
#define XBAR_OUT_6MUX16TO31CFG_R    (*((volatile uint32_t *)0x00007A96))
#define XBAR_OUT_7MUX0TO15CFG_R     (*((volatile uint32_t *)0x00007A98))
#define XBAR_OUT_7MUX16TO31CFG_R    (*((volatile uint32_t *)0x00007A9A))
#define XBAR_OUT_8MUX0TO15CFG_R     (*((volatile uint32_t *)0x00007A9C))
#define XBAR_OUT_8MUX16TO31CFG_R    (*((volatile uint32_t *)0x00007A9E))
#define XBAR_OUT_1MUXEN_R           (*((volatile uint32_t *)0x00007AA0))
#define XBAR_OUT_2MUXEN_R           (*((volatile uint32_t *)0x00007AA2))
#define XBAR_OUT_3MUXEN_R           (*((volatile uint32_t *)0x00007AA4))
#define XBAR_OUT_4MUXEN_R           (*((volatile uint32_t *)0x00007AA6))
#define XBAR_OUT_5MUXEN_R           (*((volatile uint32_t *)0x00007AA8))
#define XBAR_OUT_6MUXEN_R           (*((volatile uint32_t *)0x00007AAA))
#define XBAR_OUT_7MUXEN_R           (*((volatile uint32_t *)0x00007AAC))
#define XBAR_OUT_8MUXEN_R           (*((volatile uint32_t *)0x00007AAE))
#define XBAR_OUT_LATCH_R            (*((volatile uint32_t *)0x00007AB0))
#define XBAR_OUT_LATCHCLR_R         (*((volatile uint32_t *)0x00007AB2))
#define XBAR_OUT_LATCHFRC_R         (*((volatile uint32_t *)0x00007AB4))
#define XBAR_OUT_LATCHEN_R          (*((volatile uint32_t *)0x00007AB6))
#define XBAR_OUT_INV_R              (*((volatile uint32_t *)0x00007AB8))
#define XBAR_OUT_LOCK_R             (*((volatile uint32_t *)0x00007ABE))

//*****************************************************************************
//
// DMA CLA Source Select Register (DMA_CLA_SRC_SEL_REG)
//
//*****************************************************************************
#define DMACLASSR_CLA1TASKSRCSELLOCK_R      (*((volatile uint32_t *)0x00007980))
#define DMACLASSR_DMACHSRCSELLOCK_R         (*((volatile uint32_t *)0x00007984))
#define DMACLASSR_CLA1TASKSRCSEL1_R         (*((volatile uint32_t *)0x00007986))
#define DMACLASSR_CLA1TASKSRCSEL2_R         (*((volatile uint32_t *)0x00007988))
#define DMACLASSR_DMACHSRCSEL1_R            (*((volatile uint32_t *)0x00007996))
#define DMACLASSR_DMACHSRCSEL2_R            (*((volatile uint32_t *)0x00007998))

//*****************************************************************************
//
// GPIO registers (PORTA)
//
//*****************************************************************************
#define GPIO_PORTA_CTRL_R           (*((volatile uint32_t *)0x00007C00))
#define GPIO_PORTA_QSEL1_R          (*((volatile uint32_t *)0x00007C02))
#define GPIO_PORTA_QSEL2_R          (*((volatile uint32_t *)0x00007C04))
#define GPIO_PORTA_MUX1_R           (*((volatile uint32_t *)0x00007C06))
#define GPIO_PORTA_MUX2_R           (*((volatile uint32_t *)0x00007C08))
#define GPIO_PORTA_DIR_R            (*((volatile uint32_t *)0x00007C0A))
#define GPIO_PORTA_PUD_R            (*((volatile uint32_t *)0x00007C0C))
#define GPIO_PORTA_INV_R            (*((volatile uint32_t *)0x00007C10))
#define GPIO_PORTA_ODR_R            (*((volatile uint32_t *)0x00007C12))
#define GPIO_PORTA_GMUX1_R          (*((volatile uint32_t *)0x00007C20))
#define GPIO_PORTA_GMUX2_R          (*((volatile uint32_t *)0x00007C22))
#define GPIO_PORTA_CSEL1_R          (*((volatile uint32_t *)0x00007C28))
#define GPIO_PORTA_CSEL2_R          (*((volatile uint32_t *)0x00007C2A))
#define GPIO_PORTA_CSEL3_R          (*((volatile uint32_t *)0x00007C2C))
#define GPIO_PORTA_CSEL4_R          (*((volatile uint32_t *)0x00007C2E))
#define GPIO_PORTA_LOCK_R           (*((volatile uint32_t *)0x00007C3C))


#define GPIO_PORTA_DAT_R            (*((volatile uint32_t *)0x00007F00))
#define GPIO_PORTA_SET_R            (*((volatile uint32_t *)0x00007F02))
#define GPIO_PORTA_CLEAR_R          (*((volatile uint32_t *)0x00007F04))
#define GPIO_PORTA_TOGGLE_R         (*((volatile uint32_t *)0x00007F06))

//*****************************************************************************
//
// GPIO registers (PORTB)
//
//*****************************************************************************
#define GPIO_PORTB_CTRL_R           (*((volatile uint32_t *)0x00007C40))
#define GPIO_PORTB_QSEL1_R          (*((volatile uint32_t *)0x00007C42))
#define GPIO_PORTB_QSEL2_R          (*((volatile uint32_t *)0x00007C44))
#define GPIO_PORTB_MUX1_R           (*((volatile uint32_t *)0x00007C46))
#define GPIO_PORTB_MUX2_R           (*((volatile uint32_t *)0x00007C48))
#define GPIO_PORTB_DIR_R            (*((volatile uint32_t *)0x00007C4A))
#define GPIO_PORTB_PUD_R            (*((volatile uint32_t *)0x00007C4C))
#define GPIO_PORTB_INV_R            (*((volatile uint32_t *)0x00007C50))
#define GPIO_PORTB_ODR_R            (*((volatile uint32_t *)0x00007C52))
#define GPIO_PORTB_AMSEL_R          (*((volatile uint32_t *)0x00007C54))
#define GPIO_PORTB_GMUX1_R          (*((volatile uint32_t *)0x00007C60))
#define GPIO_PORTB_GMUX2_R          (*((volatile uint32_t *)0x00007C62))
#define GPIO_PORTB_CSEL1_R          (*((volatile uint32_t *)0x00007C68))
#define GPIO_PORTB_CSEL2_R          (*((volatile uint32_t *)0x00007C6A))
#define GPIO_PORTB_CSEL3_R          (*((volatile uint32_t *)0x00007C6C))
#define GPIO_PORTB_CSEL4_R          (*((volatile uint32_t *)0x00007C6E))
#define GPIO_PORTB_LOCK_R           (*((volatile uint32_t *)0x00007C7C))
#define GPIO_PORTB_CR_R             (*((volatile uint32_t *)0x00007C7E))

#define GPIO_PORTB_DAT_R            (*((volatile uint32_t *)0x00007F08))
#define GPIO_PORTB_SET_R            (*((volatile uint32_t *)0x00007F0A))
#define GPIO_PORTB_CLEAR_R          (*((volatile uint32_t *)0x00007F0C))
#define GPIO_PORTB_TOGGLE_R         (*((volatile uint32_t *)0x00007F0E))

//*****************************************************************************
//
// GPIO registers (PORTC)
//
//*****************************************************************************
#define GPIO_PORTC_CTRL_R           (*((volatile uint32_t *)0x00007C80))
#define GPIO_PORTC_QSEL1_R          (*((volatile uint32_t *)0x00007C82))
#define GPIO_PORTC_QSEL2_R          (*((volatile uint32_t *)0x00007C84))
#define GPIO_PORTC_MUX1_R           (*((volatile uint32_t *)0x00007C86))
#define GPIO_PORTC_MUX2_R           (*((volatile uint32_t *)0x00007C88))
#define GPIO_PORTC_DIR_R            (*((volatile uint32_t *)0x00007C8A))
#define GPIO_PORTC_PUD_R            (*((volatile uint32_t *)0x00007C8C))
#define GPIO_PORTC_INV_R            (*((volatile uint32_t *)0x00007C90))
#define GPIO_PORTC_ODR_R            (*((volatile uint32_t *)0x00007C92))
#define GPIO_PORTC_GMUX1_R          (*((volatile uint32_t *)0x00007CA0))
#define GPIO_PORTC_GMUX2_R          (*((volatile uint32_t *)0x00007CA2))
#define GPIO_PORTC_CSEL1_R          (*((volatile uint32_t *)0x00007CA8))
#define GPIO_PORTC_CSEL2_R          (*((volatile uint32_t *)0x00007CAA))
#define GPIO_PORTC_CSEL3_R          (*((volatile uint32_t *)0x00007CAC))
#define GPIO_PORTC_CSEL4_R          (*((volatile uint32_t *)0x00007CAE))
#define GPIO_PORTC_LOCK_R           (*((volatile uint32_t *)0x00007CBC))
#define GPIO_PORTC_CR_R             (*((volatile uint32_t *)0x00007CBE))

#define GPIO_PORTC_DAT_R            (*((volatile uint32_t *)0x00007F10))
#define GPIO_PORTC_SET_R            (*((volatile uint32_t *)0x00007F12))
#define GPIO_PORTC_CLEAR_R          (*((volatile uint32_t *)0x00007F14))
#define GPIO_PORTC_TOGGLE_R         (*((volatile uint32_t *)0x00007F16))

//*****************************************************************************
//
// GPIO registers (PORTD)
//
//*****************************************************************************
#define GPIO_PORTD_CTRL_R           (*((volatile uint32_t *)0x00007CC0))
#define GPIO_PORTD_QSEL1_R          (*((volatile uint32_t *)0x00007CC2))
#define GPIO_PORTD_QSEL2_R          (*((volatile uint32_t *)0x00007CC4))
#define GPIO_PORTD_MUX1_R           (*((volatile uint32_t *)0x00007CC6))
#define GPIO_PORTD_MUX2_R           (*((volatile uint32_t *)0x00007CC8))
#define GPIO_PORTD_DIR_R            (*((volatile uint32_t *)0x00007CCA))
#define GPIO_PORTD_PUD_R            (*((volatile uint32_t *)0x00007CCC))
#define GPIO_PORTD_INV_R            (*((volatile uint32_t *)0x00007CD0))
#define GPIO_PORTD_ODR_R            (*((volatile uint32_t *)0x00007CD2))
#define GPIO_PORTD_GMUX1_R          (*((volatile uint32_t *)0x00007CE0))
#define GPIO_PORTD_GMUX2_R          (*((volatile uint32_t *)0x00007CE2))
#define GPIO_PORTD_CSEL1_R          (*((volatile uint32_t *)0x00007CE8))
#define GPIO_PORTD_CSEL2_R          (*((volatile uint32_t *)0x00007CEA))
#define GPIO_PORTD_CSEL3_R          (*((volatile uint32_t *)0x00007CEC))
#define GPIO_PORTD_CSEL4_R          (*((volatile uint32_t *)0x00007CEE))
#define GPIO_PORTD_LOCK_R           (*((volatile uint32_t *)0x00007CFC))
#define GPIO_PORTD_CR_R             (*((volatile uint32_t *)0x00007CFE))

#define GPIO_PORTD_DAT_R            (*((volatile uint32_t *)0x00007F18))
#define GPIO_PORTD_SET_R            (*((volatile uint32_t *)0x00007F1A))
#define GPIO_PORTD_CLEAR_R          (*((volatile uint32_t *)0x00007F1C))
#define GPIO_PORTD_TOGGLE_R         (*((volatile uint32_t *)0x00007F1E))

//*****************************************************************************
//
// GPIO registers (PORTE)
//
//*****************************************************************************
#define GPIO_PORTE_CTRL_R           (*((volatile uint32_t *)0x00007D00))
#define GPIO_PORTE_QSEL1_R          (*((volatile uint32_t *)0x00007D02))
#define GPIO_PORTE_QSEL2_R          (*((volatile uint32_t *)0x00007D04))
#define GPIO_PORTE_MUX1_R           (*((volatile uint32_t *)0x00007D06))
#define GPIO_PORTE_MUX2_R           (*((volatile uint32_t *)0x00007D08))
#define GPIO_PORTE_DIR_R            (*((volatile uint32_t *)0x00007D0A))
#define GPIO_PORTE_PUD_R            (*((volatile uint32_t *)0x00007D0C))
#define GPIO_PORTE_INV_R            (*((volatile uint32_t *)0x00007D10))
#define GPIO_PORTE_ODR_R            (*((volatile uint32_t *)0x00007D12))
#define GPIO_PORTE_GMUX1_R          (*((volatile uint32_t *)0x00007D20))
#define GPIO_PORTE_GMUX2_R          (*((volatile uint32_t *)0x00007D22))
#define GPIO_PORTE_CSEL1_R          (*((volatile uint32_t *)0x00007D28))
#define GPIO_PORTE_CSEL2_R          (*((volatile uint32_t *)0x00007D2A))
#define GPIO_PORTE_CSEL3_R          (*((volatile uint32_t *)0x00007D2C))
#define GPIO_PORTE_CSEL4_R          (*((volatile uint32_t *)0x00007D2E))
#define GPIO_PORTE_LOCK_R           (*((volatile uint32_t *)0x00007D3C))
#define GPIO_PORTE_CR_R             (*((volatile uint32_t *)0x00007D3E))

