Daniel9719/Emotion_Detector_UNAM/CCS/Sensor_Testing_Files/tms320f28379d.h
#define GPIO_PORTE_DAT_R            (*((volatile uint32_t *)0x00007F20))
#define GPIO_PORTE_SET_R            (*((volatile uint32_t *)0x00007F22))
#define GPIO_PORTE_CLEAR_R          (*((volatile uint32_t *)0x00007F24))
#define GPIO_PORTE_TOGGLE_R         (*((volatile uint32_t *)0x00007F26))

//*****************************************************************************
//
// GPIO registers (PORTF)
//
//*****************************************************************************
#define GPIO_PORTF_CTRL_R           (*((volatile uint32_t *)0x00007D40))
#define GPIO_PORTF_QSEL1_R          (*((volatile uint32_t *)0x00007D42))
#define GPIO_PORTF_MUX1_R           (*((volatile uint32_t *)0x00007D46))
#define GPIO_PORTF_DIR_R            (*((volatile uint32_t *)0x00007D4A))
#define GPIO_PORTF_PUD_R            (*((volatile uint32_t *)0x00007D4C))
#define GPIO_PORTF_INV_R            (*((volatile uint32_t *)0x00007D50))
#define GPIO_PORTF_ODR_R            (*((volatile uint32_t *)0x00007D52))
#define GPIO_PORTF_GMUX1_R          (*((volatile uint32_t *)0x00007D60))
#define GPIO_PORTF_CSEL1_R          (*((volatile uint32_t *)0x00007D68))
#define GPIO_PORTF_CSEL2_R          (*((volatile uint32_t *)0x00007D6A))
#define GPIO_PORTF_LOCK_R           (*((volatile uint32_t *)0x00007D7C))
#define GPIO_PORTF_CR_R             (*((volatile uint32_t *)0x00007D7E))

#define GPIO_PORTF_DAT_R            (*((volatile uint32_t *)0x00007F28))
#define GPIO_PORTF_SET_R            (*((volatile uint32_t *)0x00007F2A))
#define GPIO_PORTF_CLEAR_R          (*((volatile uint32_t *)0x00007F2C))
#define GPIO_PORTF_TOGGLE_R         (*((volatile uint32_t *)0x00007F2E))

//*****************************************************************************
//
// IPC registers (IPC_REGS_CPU)
//
//*****************************************************************************
#define IPC_CPU_ACK_R               (*((volatile uint32_t *)0x00050000))
#define IPC_CPU_STS_R               (*((volatile uint32_t *)0x00050002))
#define IPC_CPU_SET_R               (*((volatile uint32_t *)0x00050004))
#define IPC_CPU_CLR_R               (*((volatile uint32_t *)0x00050006))
#define IPC_CPU_FLG_R               (*((volatile uint32_t *)0x00050008))
#define IPC_CPU_COUNTERL_R          (*((volatile uint32_t *)0x0005000C))
#define IPC_CPU_COUNTERH_R          (*((volatile uint32_t *)0x0005000E))
#define IPC_CPU_SENDCOM_R           (*((volatile uint32_t *)0x00050010))
#define IPC_CPU_SENDADDR_R          (*((volatile uint32_t *)0x00050012))
#define IPC_CPU_SENDDATA_R          (*((volatile uint32_t *)0x00050014))
#define IPC_CPU_REMOTEREPLY_R       (*((volatile uint32_t *)0x00050016))
#define IPC_CPU_RECVCOM_R           (*((volatile uint32_t *)0x00050018))
#define IPC_CPU_RECVADDR_R          (*((volatile uint32_t *)0x0005001A))
#define IPC_CPU_RECVDATA_R          (*((volatile uint32_t *)0x0005001C))
#define IPC_CPU_LOCALREPLY_R        (*((volatile uint32_t *)0x0005001E))
#define IPC_CPU_BOOTSTS_R           (*((volatile uint32_t *)0x00050020))
#define IPC_CPU_BOOTMODE_R          (*((volatile uint32_t *)0x00050022))

//*****************************************************************************
//
// Clock Configuration registers (CLK_CFG_REGS)
//
//*****************************************************************************
#define CLKCFG_SEM_R                (*((volatile uint32_t *)0x0005D200))
#define CLKCFG_LOCK1_R              (*((volatile uint32_t *)0x0005D202))
#define CLKCFG_SRCCTL1_R            (*((volatile uint32_t *)0x0005D208))
#define CLKCFG_SRCCTL2_R            (*((volatile uint32_t *)0x0005D20A))
#define CLKCFG_SRCCTL3_R            (*((volatile uint32_t *)0x0005D20C))
#define CLKCFG_SYSPLLCTL1_R         (*((volatile uint32_t *)0x0005D20E))
#define CLKCFG_SYSPLLMULT_R         (*((volatile uint32_t *)0x0005D214))
#define CLKCFG_SYSYPLLSTS_R         (*((volatile uint32_t *)0x0005D216))
#define CLKCFG_AUXPLLCTL1_R         (*((volatile uint32_t *)0x0005D218))
#define CLKCFG_AUXPLLMULT_R         (*((volatile uint32_t *)0x0005D21E))
#define CLKCFG_AUXPLLSTS_R          (*((volatile uint32_t *)0x0005D220))
#define CLKCFG_SYSCLKDIVSEL_R       (*((volatile uint32_t *)0x0005D222))
#define CLKCFG_AUXCLKDIVSEL_R       (*((volatile uint32_t *)0x0005D224))
#define CLKCFG_PERCLKDIVSEL_R       (*((volatile uint32_t *)0x0005D226))
#define CLKCFG_XCLKOUTDIVSEL_R      (*((volatile uint32_t *)0x0005D228))
#define CLKCFG_LOSPCP_R             (*((volatile uint32_t *)0x0005D22C))
#define CLKCFG_MCDCR_R              (*((volatile uint32_t *)0x0005D22E))
#define CLKCFG_X1CNT_R              (*((volatile uint32_t *)0x0005D230))

//*****************************************************************************
//
// CPU System registers (CPU_SYS_REGS)
//
//*****************************************************************************
#define CPUSYS_CPUSYSLOCK_R         (*((volatile uint32_t *)0x0005D300))
#define CPUSYS_HIBBOOTMODE_R        (*((volatile uint32_t *)0x0005D306))
#define CPUSYS_IORESTOREADDR_R      (*((volatile uint32_t *)0x0005D308))
#define CPUSYS_PIEVERRADDR_R        (*((volatile uint32_t *)0x0005D30A))
#define CPUSYS_PCLKCR0_R            (*((volatile uint32_t *)0x0005D322))
#define CPUSYS_PCLKCR1_R            (*((volatile uint32_t *)0x0005D324))
#define CPUSYS_PCLKCR2_R            (*((volatile uint32_t *)0x0005D326))
#define CPUSYS_PCLKCR3_R            (*((volatile uint32_t *)0x0005D328))
#define CPUSYS_PCLKCR4_R            (*((volatile uint32_t *)0x0005D32A))
#define CPUSYS_PCLKCR6_R            (*((volatile uint32_t *)0x0005D32E))
#define CPUSYS_PCLKCR7_R            (*((volatile uint32_t *)0x0005D330))
#define CPUSYS_PCLKCR8_R            (*((volatile uint32_t *)0x0005D332))
#define CPUSYS_PCLKCR9_R            (*((volatile uint32_t *)0x0005D334))
#define CPUSYS_PCLKCR10_R           (*((volatile uint32_t *)0x0005D336))
#define CPUSYS_PCLKCR11_R           (*((volatile uint32_t *)0x0005D338))
#define CPUSYS_PCLKCR12_R           (*((volatile uint32_t *)0x0005D33A))
#define CPUSYS_PCLKCR13_R           (*((volatile uint32_t *)0x0005D33C))
#define CPUSYS_PCLKCR14_R           (*((volatile uint32_t *)0x0005D33E))
#define CPUSYS_PCLKCR16_R           (*((volatile uint32_t *)0x0005D342))
#define CPUSYS_SECMSEL_R            (*((volatile uint32_t *)0x0005D374))
#define CPUSYS_LPMCR_R              (*((volatile uint32_t *)0x0005D376))
#define CPUSYS_GPIOLPMSEL0_R        (*((volatile uint32_t *)0x0005D378))
#define CPUSYS_GPIOLPMSEL1_R        (*((volatile uint32_t *)0x0005D37A))
#define CPUSYS_TMR2CLKCTL_R         (*((volatile uint32_t *)0x0005D37C))
#define CPUSYS_RESC_R               (*((volatile uint32_t *)0x0005D380))


//*****************************************************************************
//
// Memory Configuration REgisters (MEM_CFG_REGS)
//
//*****************************************************************************
#define MEMCFG_DxLOCK_R             (*((volatile uint32_t *)0x0005F400))
#define MEMCFG_DxCOMMIT_R           (*((volatile uint32_t *)0x0005F402))
#define MEMCFG_DxACCPROT0_R         (*((volatile uint32_t *)0x0005F408))
#define MEMCFG_DxTEST_R             (*((volatile uint32_t *)0x0005F410))
#define MEMCFG_DxINIT_R             (*((volatile uint32_t *)0x0005F412))
#define MEMCFG_DxINITDONE_R         (*((volatile uint32_t *)0x0005F414))
#define MEMCFG_LSxLOCK_R            (*((volatile uint32_t *)0x0005F420))
#define MEMCFG_LSxCOMMIT_R          (*((volatile uint32_t *)0x0005F422))
#define MEMCFG_LSxMSEL_R            (*((volatile uint32_t *)0x0005F424))
#define MEMCFG_LSxCLAPGM_R          (*((volatile uint32_t *)0x0005F426))
#define MEMCFG_LSxACCPROT0_R        (*((volatile uint32_t *)0x0005F428))
#define MEMCFG_LSxACCPROT1_R        (*((volatile uint32_t *)0x0005F42A))
#define MEMCFG_LSxTEST_R            (*((volatile uint32_t *)0x0005F430))
#define MEMCFG_LSxINIT_R            (*((volatile uint32_t *)0x0005F432))
#define MEMCFG_LSxINITDONE_R        (*((volatile uint32_t *)0x0005F434))
#define MEMCFG_GSxLOCK_R            (*((volatile uint32_t *)0x0005F440))
#define MEMCFG_GSxCOMMIT_R          (*((volatile uint32_t *)0x0005F442))
#define MEMCFG_GSxMSEL_R            (*((volatile uint32_t *)0x0005F444))
#define MEMCFG_GSxACCPROT0_R        (*((volatile uint32_t *)0x0005F448))
#define MEMCFG_GSxACCPROT1_R        (*((volatile uint32_t *)0x0005F44A))
#define MEMCFG_GSxACCPROT2_R        (*((volatile uint32_t *)0x0005F44C))
#define MEMCFG_GSxACCPROT3_R        (*((volatile uint32_t *)0x0005F44E))
#define MEMCFG_GSxTEST_R            (*((volatile uint32_t *)0x0005F450))
#define MEMCFG_GSxINIT_R            (*((volatile uint32_t *)0x0005F452))
#define MEMCFG_GSxINITDONE_R        (*((volatile uint32_t *)0x0005F454))
#define MEMCFG_MSGxTEST_R           (*((volatile uint32_t *)0x0005F470))
#define MEMCFG_MSGxINIT_R           (*((volatile uint32_t *)0x0005F472))
#define MEMCFG_MSGxINITDONE_R       (*((volatile uint32_t *)0x0005F474))

#endif /* TMS320F28379D_H_ */
